{
  "0": "<PAD>",
  "1": "<UNK>",
  "2": "<BOS>",
  "3": "<EOS>",
  "4": "<CPP>",
  "5": "<CODE>",
  "6": "!",
  "7": "\"",
  "8": "#",
  "9": "$",
  "10": "%",
  "11": "&",
  "12": "'",
  "13": "(",
  "14": ")",
  "15": "*",
  "16": "+",
  "17": ",",
  "18": "-",
  "19": ".",
  "20": "/",
  "21": "0",
  "22": "1",
  "23": "2",
  "24": "3",
  "25": "4",
  "26": "5",
  "27": "6",
  "28": "7",
  "29": "8",
  "30": "9",
  "31": ":",
  "32": ";",
  "33": "<",
  "34": "</w>",
  "35": "=",
  "36": ">",
  "37": "?",
  "38": "@",
  "39": "A",
  "40": "B",
  "41": "C",
  "42": "D",
  "43": "E",
  "44": "F",
  "45": "G",
  "46": "H",
  "47": "I",
  "48": "J",
  "49": "K",
  "50": "L",
  "51": "M",
  "52": "N",
  "53": "O",
  "54": "P",
  "55": "Q",
  "56": "R",
  "57": "S",
  "58": "T",
  "59": "U",
  "60": "V",
  "61": "W",
  "62": "X",
  "63": "Y",
  "64": "Z",
  "65": "[",
  "66": "\\",
  "67": "]",
  "68": "^",
  "69": "_",
  "70": "`",
  "71": "a",
  "72": "b",
  "73": "c",
  "74": "d",
  "75": "e",
  "76": "f",
  "77": "g",
  "78": "h",
  "79": "i",
  "80": "j",
  "81": "k",
  "82": "l",
  "83": "m",
  "84": "n",
  "85": "o",
  "86": "p",
  "87": "q",
  "88": "r",
  "89": "s",
  "90": "t",
  "91": "u",
  "92": "v",
  "93": "w",
  "94": "x",
  "95": "y",
  "96": "z",
  "97": "{",
  "98": "|",
  "99": "}",
  "100": "~",
  "101": "ВЎ",
  "102": "Вў",
  "103": "ВЈ",
  "104": "ВӨ",
  "105": "ВҘ",
  "106": "ВҰ",
  "107": "В§",
  "108": "ВЁ",
  "109": "В©",
  "110": "В«",
  "111": "В¬",
  "112": "Вӯ",
  "113": "В®",
  "114": "ВҜ",
  "115": "В°",
  "116": "Вұ",
  "117": "ВІ",
  "118": "Ві",
  "119": "Вҙ",
  "120": "Вө",
  "121": "В¶",
  "122": "В·",
  "123": "Вё",
  "124": "В№",
  "125": "Вә",
  "126": "В»",
  "127": "Вј",
  "128": "ВҪ",
  "129": "Вҫ",
  "130": "Вҝ",
  "131": "ГӮ",
  "132": "Гғ",
  "133": "ГҺ",
  "134": "ГҸ",
  "135": "Гҗ",
  "136": "Г‘",
  "137": "Г—",
  "138": "Гҳ",
  "139": "Гҷ",
  "140": "Гў",
  "141": "ГЈ",
  "142": "ГӨ",
  "143": "ГҘ",
  "144": "Г§",
  "145": "ГҜ",
  "146": "Г°",
  "147": "оӮҖ",
  "148": "оӮҒ",
  "149": "оӮӮ",
  "150": "оӮғ",
  "151": "оӮ„",
  "152": "оӮ…",
  "153": "оӮҶ",
  "154": "оӮҮ",
  "155": "оӮҲ",
  "156": "оӮү",
  "157": "оӮҠ",
  "158": "оӮӢ",
  "159": "оӮҢ",
  "160": "оӮҚ",
  "161": "оӮҺ",
  "162": "оӮҸ",
  "163": "оӮҗ",
  "164": "оӮ‘",
  "165": "оӮ’",
  "166": "оӮ“",
  "167": "оӮ”",
  "168": "оӮ•",
  "169": "оӮ–",
  "170": "оӮ—",
  "171": "оӮҳ",
  "172": "оӮҷ",
  "173": "оӮҡ",
  "174": "оӮӣ",
  "175": "оӮң",
  "176": "оӮқ",
  "177": "оӮһ",
  "178": "оӮҹ",
  "179": "оӮ ",
  "180": "оҖҖ",
  "181": "оҖҒ",
  "182": "оҖӮ",
  "183": "оҖғ",
  "184": "оҖ„",
  "185": "оҖ…",
  "186": "оҖҶ",
  "187": "оҖҮ",
  "188": "оҖҲ",
  "189": "\t",
  "190": "\n",
  "191": "оҖӢ",
  "192": "оҖҢ",
  "193": "\r",
  "194": "оҖҺ",
  "195": "оҖҸ",
  "196": "оҖҗ",
  "197": "оҖ‘",
  "198": "оҖ’",
  "199": "оҖ“",
  "200": "оҖ”",
  "201": "оҖ•",
  "202": "оҖ–",
  "203": "оҖ—",
  "204": "оҖҳ",
  "205": "оҖҷ",
  "206": "оҖҡ",
  "207": "оҖӣ",
  "208": "оҖң",
  "209": "оҖқ",
  "210": "оҖһ",
  "211": "оҖҹ",
  "212": " ",
  "213": "оҒҝ",
  "214": "ВӘ",
  "215": "ГҖ",
  "216": "ГҒ",
  "217": "Г„",
  "218": "Г…",
  "219": "ГҶ",
  "220": "ГҮ",
  "221": "ГҲ",
  "222": "Гү",
  "223": "ГҠ",
  "224": "ГӢ",
  "225": "ГҢ",
  "226": "ГҚ",
  "227": "Г’",
  "228": "Г“",
  "229": "Г”",
  "230": "Г•",
  "231": "Г–",
  "232": "Гҡ",
  "233": "Гӣ",
  "234": "Гң",
  "235": "Гқ",
  "236": "Гһ",
  "237": "Гҹ",
  "238": "Г ",
  "239": "ГЎ",
  "240": "ГҰ",
  "241": "ГЁ",
  "242": "Г©",
  "243": "ГӘ",
  "244": "Г«",
  "245": "Г¬",
  "246": "Гӯ",
  "247": "Г®",
  "248": "Гұ",
  "249": "ГІ",
  "250": "Гі",
  "251": "Гҙ",
  "252": "Гө",
  "253": "Г¶",
  "254": "Г·",
  "255": "Гё",
  "256": "Г№",
  "257": "Гә",
  "258": "Г»",
  "259": "Гј",
  "260": "ГҪ",
  "261": "Гҫ",
  "262": "Гҝ",
  "263": "\\n",
  "264": ";\\n",
  "265": "st",
  "266": "in",
  "267": "\\\"",
  "268": "<<",
  "269": "co",
  "270": "re",
  "271": "::",
  "272": "std",
  "273": "en",
  "274": "std::",
  "275": "ГҗВө",
  "276": "{\\n",
  "277": "ut",
  "278": "er",
  "279": "ГҗВҫ",
  "280": "<<\\\"",
  "281": "int",
  "282": "()",
  "283": "ГҗВ°",
  "284": "or",
  "285": ";\\n}",
  "286": "ГҗВё",
  "287": "at",
  "288": "de",
  "289": "cout",
  "290": "cout<<",
  "291": "ГҗВҪ",
  "292": "}\\n",
  "293": "\\\"<<",
  "294": "end",
  "295": "le",
  "296": ";\\n\\n",
  "297": "endl",
  "298": "Г‘оӮӮ",
  "299": "al",
  "300": "endl;\\n",
  "301": "cl",
  "302": ");\\n",
  "303": "ur",
  "304": "Г‘оӮҖ",
  "305": "ГҗВҫГҗ",
  "306": "){\\n",
  "307": "Г‘оӮҒ",
  "308": "ing",
  "309": "am",
  "310": "on",
  "311": "ret",
  "312": "str",
  "313": "ar",
  "314": ">\\n",
  "315": "se",
  "316": "urn",
  "317": "return",
  "318": "ct",
  "319": "ude",
  "320": "incl",
  "321": "ude<",
  "322": "include",
  "323": "#include",
  "324": "#include<",
  "325": "ГҗВөГҗ",
  "326": ":\\\"",
  "327": "std::cout",
  "328": "std::cout<<",
  "329": "si",
  "330": "ma",
  "331": "ub",
  "332": "const",
  "333": "<<std::",
  "334": "ce",
  "335": "th",
  "336": "==",
  "337": "ГҗВ°Гҗ",
  "338": "\\\"Гҗ",
  "339": "string",
  "340": "un",
  "341": "if",
  "342": "id",
  "343": "ue",
  "344": "ve",
  "345": "std::endl;\\n",
  "346": "<<std::endl;\\n",
  "347": "<<endl;\\n",
  "348": "}\\n\\n",
  "349": "te",
  "350": "tr",
  "351": "ge",
  "352": "if(",
  "353": "ame",
  "354": ">\\n#include",
  "355": ">\\n#include<",
  "356": "<<\\\"Гҗ",
  "357": "an",
  "358": "ГҗВ»",
  "359": "ze",
  "360": "ic",
  "361": "ГҗВІ",
  "362": "ГҗВә",
  "363": ";\\n}\\n",
  "364": "ch",
  "365": "do",
  "366": "(){\\n",
  "367": "Г‘оӮғ",
  "368": "Г‘оӮҸ",
  "369": "Г‘оӮӢ",
  "370": "size",
  "371": "ss",
  "372": "ion",
  "373": "ck",
  "374": "ro",
  "375": "ctor",
  "376": "mp",
  "377": "in()",
  "378": "ad",
  "379": "it",
  "380": "stream",
  "381": "um",
  "382": "io",
  "383": "for",
  "384": "ГҗВҝ",
  "385": "//",
  "386": "uble",
  "387": "vo",
  "388": "double",
  "389": "ГҗВј",
  "390": "ul",
  "391": "=0",
  "392": "void",
  "393": "intma",
  "394": "<io",
  "395": "return0",
  "396": "\\\";\\n",
  "397": "is",
  "398": "0;\\n}",
  "399": "pe",
  "400": "<iostream",
  "401": "lo",
  "402": "for(",
  "403": "in(){\\n",
  "404": "main()",
  "405": "main(){\\n",
  "406": "intmain()",
  "407": "return0;\\n}",
  "408": "0;\\n}</w>",
  "409": "return0;\\n}</w>",
  "410": "val",
  "411": "ГҗВҙ",
  "412": "name",
  "413": "#include<iostream",
  "414": "vector",
  "415": "Г‘оӮҮ",
  "416": "//Гҗ",
  "417": "get",
  "418": "me",
  "419": "Г‘оӮҒГ‘оӮӮ",
  "420": "Г‘оӮҢ",
  "421": "pa",
  "422": "ig",
  "423": "unt",
  "424": "ata",
  "425": "ty",
  "426": "ne",
  "427": "++",
  "428": "pr",
  "429": "=\\\"",
  "430": ";i",
  "431": "ol",
  "432": "(int",
  "433": "lic",
  "434": "\\\\n",
  "435": "(const",
  "436": "ГҗВөГ‘оӮҖ",
  "437": "pub",
  "438": "public",
  "439": ":\\n",
  "440": "->",
  "441": "s.",
  "442": "ult",
  "443": "ir",
  "444": "sh",
  "445": "std::string",
  "446": "ptr",
  "447": "ile",
  "448": "to",
  "449": "\\\",",
  "450": "vector<",
  "451": "ass",
  "452": "0)",
  "453": "data",
  "454": "[i",
  "455": "res",
  "456": "(\\\"",
  "457": ");\\n}\\n",
  "458": "class",
  "459": "}\\n}",
  "460": "value",
  "461": "<iostream>\\n#include",
  "462": "\\n//",
  "463": "el",
  "464": "Co",
  "465": "<iostream>\\n#include<",
  "466": "num",
  "467": "#include<iostream>\\n#include",
  "468": "{\\nstd::cout",
  "469": "{\\ncout",
  "470": "Re",
  "471": "[i]",
  "472": "ay",
  "473": "()const",
  "474": "ase",
  "475": "ГҗВ·",
  "476": "arr",
  "477": ");\\n\\n",
  "478": "bo",
  "479": "_t",
  "480": "public:\\n",
  "481": "auto",
  "482": "using",
  "483": "0;\\n",
  "484": "ther",
  "485": ")<<",
  "486": "0,",
  "487": ";\\n\\nint",
  "488": "other",
  "489": "pace",
  "490": "igh",
  "491": "names",
  "492": "\\\"\\\\n",
  "493": "<<\\\"\\\\n",
  "494": "po",
  "495": "ack",
  "496": "0;",
  "497": "namespace",
  "498": ">>",
  "499": "ГҗВөГҗВҪГҗВё",
  "500": "}\\n}\\n",
  "501": ";\\n\\nintmain()",
  "502": "usingnamespace",
  "503": ">\\nusing",
  "504": "namespacestd",
  "505": ">\\nusingnamespace",
  "506": "Г‘оӮҶ",
  "507": "result",
  "508": "i=",
  "509": "ode",
  "510": "ГҗВҪГҗВ°",
  "511": "count",
  "512": "\\nreturn",
  "513": "ГҗВұ",
  "514": ">\\n\\n",
  "515": "i<",
  "516": "ime",
  "517": "ГҗВҪГ‘оӮӢ",
  "518": "t(",
  "519": "char",
  "520": "ap",
  "521": "add",
  "522": "s)",
  "523": "que",
  "524": "{\\nint",
  "525": "=0;",
  "526": "ex",
  "527": "++)",
  "528": "1,",
  "529": "\\nstd::cout",
  "530": "\\ncout",
  "531": "ke",
  "532": "ГҗВ°Г‘оӮӮ",
  "533": "\\\")",
  "534": "il",
  "535": "ation",
  "536": "{\\nreturn",
  "537": "ГҗВҫГ‘оӮҖ",
  "538": "bool",
  "539": "int>",
  "540": "ГҗВ№",
  "541": "]=",
  "542": "endl;\\ncout",
  "543": "};\\n",
  "544": "std::endl;\\nstd::cout",
  "545": "set",
  "546": "ГҗВёГ‘оӮӮ",
  "547": "ight",
  "548": "as",
  "549": "else",
  "550": "ГҗВөГ‘оӮӮ",
  "551": "{\\nif",
  "552": "for(int",
  "553": "++){\\n",
  "554": "In",
  "555": "),",
  "556": "ction",
  "557": "ab",
  "558": "ff",
  "559": "10",
  "560": "const{\\n",
  "561": "0;i",
  "562": "mo",
  "563": "new",
  "564": "ot",
  "565": "read",
  "566": "){",
  "567": "Г‘оӮҒГҗВ»",
  "568": "std::endl;\\n\\n",
  "569": "\\nvoid",
  "570": "endl;\\n\\n",
  "571": "std::vector<",
  "572": "type",
  "573": "i++)",
  "574": "stat",
  "575": "St",
  "576": "):",
  "577": "}else",
  "578": ";i++)",
  "579": "Г‘оӮҶГҗВё",
  "580": "s(",
  "581": "Г‘оӮ…",
  "582": "age",
  "583": "<string",
  "584": "Val",
  "585": "{return",
  "586": "ГҗВәГҗВ°",
  "587": "cond",
  "588": "Г‘оӮҲ",
  "589": "std::endl;\\n}\\n",
  "590": "ГҗоӮҹ",
  "591": "ber",
  "592": "uct",
  "593": "so",
  "594": "())",
  "595": "size_t",
  "596": "back",
  "597": "ive",
  "598": "d_",
  "599": "temp",
  "600": "-1",
  "601": "pu",
  "602": "other.",
  "603": "endl;\\n}\\n",
  "604": "oper",
  "605": "&&",
  "606": "gth",
  "607": "!=",
  "608": "of",
  "609": "i++){\\n",
  "610": "1.",
  "611": "ГҗВёГҗВј",
  "612": "()<<",
  "613": "push",
  "614": "--",
  "615": "pt",
  "616": "pl",
  "617": "ix",
  "618": "cur",
  "619": "2,",
  "620": "=0;\\n",
  "621": "];\\n",
  "622": "file",
  "623": ">(",
  "624": "2.",
  "625": "max",
  "626": "={",
  "627": "s){\\n",
  "628": "over",
  "629": "be",
  "630": "min",
  "631": "0){\\n",
  "632": "}\\n};\\n\\nintmain()",
  "633": "ual",
  "634": "wor",
  "635": "static",
  "636": "endl;\\nreturn",
  "637": "s[",
  "638": ":\\\";\\n",
  "639": ";}\\n",
  "640": "Node",
  "641": "s;\\n",
  "642": "che",
  "643": "ГҗВөГҗВҪГҗВёГҗВө",
  "644": "ind",
  "645": "std::endl;\\nreturn",
  "646": "ГҗВҫГ‘оӮӮ",
  "647": "he",
  "648": "row",
  "649": "lock",
  "650": "\\\\",
  "651": "Ty",
  "652": "ique",
  "653": "\\\",\\\"",
  "654": "Type",
  "655": ",int",
  "656": "1;\\n",
  "657": "ГҗВ»Г‘оӮҸ",
  "658": "operator",
  "659": ":\\\"<<",
  "660": "s=",
  "661": "length",
  "662": "..",
  "663": "and",
  "664": "ride",
  "665": "override",
  "666": "Г‘оӮҖГҗВҫГҗВІ",
  "667": "\\nif",
  "668": "alse",
  "669": "fa",
  "670": "_back",
  "671": "ance",
  "672": "unique",
  "673": "rent",
  "674": "Г‘оӮ„",
  "675": "(inti",
  "676": "wh",
  "677": "\\\"ГҗоӮ’",
  "678": "ac",
  "679": "{}\\n",
  "680": "uff",
  "681": "able",
  "682": "\\\":",
  "683": "ft",
  "684": "text",
  "685": "}\\nreturn",
  "686": "ГҗВі",
  "687": "ГҗВҝГ‘оӮҖ",
  "688": "const{",
  "689": "<<\\\"ГҗоӮ’",
  "690": "art",
  "691": "print",
  "692": "irt",
  "693": "irtual",
  "694": "=\\\"<<",
  "695": "gr",
  "696": "[]",
  "697": "<vector",
  "698": "Г‘оӮҺ",
  "699": "current",
  "700": "else{\\n",
  "701": "ГҗВҫГ‘оӮҒГ‘оӮӮ",
  "702": "std;\\n\\n",
  "703": "namespacestd;\\n\\n",
  "704": "))",
  "705": "ed",
  "706": "Po",
  "707": "00",
  "708": "ial",
  "709": "true",
  "710": ";//",
  "711": "ask",
  "712": "+=",
  "713": "ГҗВөГ‘оӮҒ",
  "714": "<<(",
  "715": "Г‘оӮҮГҗВё",
  "716": "\\\"\\\";\\n",
  "717": "_f",
  "718": "_back(",
  "719": "0]",
  "720": "<<\\\"ГҗоӮҹ",
  "721": "Value",
  "722": "urce",
  "723": "()){\\n",
  "724": "size()",
  "725": "key",
  "726": "left",
  "727": "\\n<<",
  "728": "virtual",
  "729": ";\\nint",
  "730": "ГҗВ°Г‘оӮҒ",
  "731": "namespacestd;\\n\\nint",
  "732": ">\\n\\nint",
  "733": "<=",
  "734": "auto&",
  "735": "Г‘оӮү",
  "736": "IN",
  "737": "second",
  "738": "\\nint",
  "739": "beg",
  "740": "ull",
  "741": "ГҗВ°ГҗВҪГҗВё",
  "742": "_c",
  "743": "{\\nif(",
  "744": "(n",
  "745": "ГҗВҪГ‘оӮӢГҗВ№",
  "746": "ГҗВёГҗВҪ",
  "747": "<iostream>\\nusing",
  "748": "<iostream>\\nusingnamespace",
  "749": "move",
  "750": "2)",
  "751": "addr",
  "752": "ta",
  "753": "#include<iostream>\\nusing",
  "754": "right",
  "755": "3,",
  "756": ";\\npublic:\\n",
  "757": "struct",
  "758": ";\\nstd::cout",
  "759": "std;\\n\\nintmain()",
  "760": ">\\n\\nintmain()",
  "761": ";\\ncout",
  "762": "{\\npublic:\\n",
  "763": "Ex",
  "764": "find",
  "765": "||",
  "766": "Base",
  "767": "uffer",
  "768": "\\\";\\n}\\n",
  "769": "delete",
  "770": "cin",
  "771": "make",
  "772": "dis",
  "773": "1)",
  "774": "[j",
  "775": "ГҗВөГҗВҪГ‘оӮӮ",
  "776": ")const",
  "777": "ГҗВөГҗВ»Г‘оӮҢ",
  "778": "ob",
  "779": "<c",
  "780": "long",
  "781": "5,",
  "782": "ГҗВёГҗВІ",
  "783": "no",
  "784": "iv",
  "785": "test",
  "786": "2=",
  "787": "while",
  "788": "{\\ndouble",
  "789": "ptr<",
  "790": "std::string&",
  "791": "[0]",
  "792": "push_back(",
  "793": "vec",
  "794": "<<\\\",",
  "795": "ГҗВЎ",
  "796": "1]",
  "797": "ГҗВҫГҗВ»Г‘оӮҢ",
  "798": "(std::",
  "799": "++;\\n",
  "800": "template",
  "801": "){}\\n",
  "802": "\\nfor",
  "803": "string&",
  "804": "empty",
  "805": "ary",
  "806": "server",
  "807": "sizeof",
  "808": "fo",
  "809": "make_",
  "810": "vent",
  "811": "3.",
  "812": "=std::",
  "813": "ak",
  "814": "us",
  "815": "=new",
  "816": "false;\\n",
  "817": "<iostream>\\n#include<string",
  "818": "loc",
  "819": "Ar",
  "820": "gor",
  "821": "override{\\n",
  "822": "cept",
  "823": "root",
  "824": "ГҗВІГҗВөГҗВҙ",
  "825": "<vector>\\n#include",
  "826": "while(",
  "827": "other)",
  "828": "ullptr",
  "829": "ent",
  "830": "cin>>",
  "831": "_cast",
  "832": "template<",
  "833": "{\\nstd::",
  "834": "Г‘оӮӮГҗВё",
  "835": "buffer",
  "836": "ize",
  "837": "0.",
  "838": "ГҗВөГҗВҪГҗВёГ‘оӮҸ",
  "839": "ГҗоӮһ",
  "840": ":public",
  "841": "is_",
  "842": "sum",
  "843": ">=",
  "844": "ГҗВҙГҗВ»Г‘оӮҸ",
  "845": "ГҗВёГҗВ·",
  "846": "Name",
  "847": "play",
  "848": "qu",
  "849": "//ГҗоӮҹ",
  "850": "ГҗВёГ‘оӮӮГҗВө",
  "851": "time",
  "852": "source",
  "853": "sizeof(",
  "854": "De",
  "855": "Г‘оӮҖГ‘оӮғ",
  "856": "ard",
  "857": "sub",
  "858": "word",
  "859": "},",
  "860": "Tr",
  "861": "ГҗВҪГҗВё",
  "862": "File",
  "863": "ГҗВІГҗВөГҗВҙГҗВёГ‘оӮӮГҗВө",
  "864": "Derived",
  "865": "\\\")<<",
  "866": "ient",
  "867": "1=",
  "868": "}\\n};\\n\\nclass",
  "869": "Г‘оӮҶГҗВёГ‘оӮҸ",
  "870": "Count",
  "871": "template<typename",
  "872": "<<\\\"ГҗВЎ",
  "873": "Lo",
  "874": "Pro",
  "875": "ГҗВҫГҗВ¶",
  "876": "Ve",
  "877": "irst",
  "878": "line",
  "879": "begin(),",
  "880": "mory",
  "881": "ag",
  "882": "\\\"ГҗоӮ’ГҗВІГҗВөГҗВҙГҗВёГ‘оӮӮГҗВө",
  "883": "<<\\\"ГҗоӮ’ГҗВІГҗВөГҗВҙГҗВёГ‘оӮӮГҗВө",
  "884": "error",
  "885": "cre",
  "886": ".end",
  "887": "ye",
  "888": "number",
  "889": "Num",
  "890": "Me",
  "891": "proce",
  "892": "&other)",
  "893": "display",
  "894": "a,",
  "895": "i)",
  "896": "Ptr",
  "897": "ГҗВёГ‘оӮҒ",
  "898": "<string>\\n#include",
  "899": "(double",
  "900": "_fd",
  "901": "Г‘оӮҚ",
  "902": ")\\n",
  "903": "ГҗоӮ’",
  "904": "ГҗВ°Г‘оӮҖ",
  "905": "};\\n\\n",
  "906": "4,",
  "907": ".get",
  "908": "Se",
  "909": "ssage",
  "910": "}\\nvoid",
  "911": "ref",
  "912": "();\\n\\n",
  "913": ".\\\"",
  "914": "ГҗВ¶",
  "915": "reak",
  "916": "day",
  "917": "ГҗВәГҗВё",
  "918": "gle",
  "919": "ГҗоӮҳ",
  "920": "ithm",
  "921": "(c",
  "922": "\\\"\\\\n=",
  "923": "<<\\\"\\\\n=",
  "924": "ГҗоӮ”",
  "925": "sy",
  "926": "aph",
  "927": "gorithm",
  "928": "andler",
  "929": "true;\\n",
  "930": "<T",
  "931": "Al",
  "932": "2;\\n",
  "933": "unique_",
  "934": ">\\n\\nclass",
  "935": "throw",
  "936": "break",
  "937": "Data",
  "938": "first",
  "939": "je",
  "940": "\\\"\\\"",
  "941": "ie",
  "942": "s,",
  "943": "\\ndouble",
  "944": "int*",
  "945": "break;\\n",
  "946": "ГҗВҫГ‘оӮҒГҗВ»",
  "947": "ГҗВІГ‘оӮӢ",
  "948": "(!",
  "949": "up",
  "950": "std;\\n\\nclass",
  "951": "namespacestd;\\n\\nclass",
  "952": "algorithm",
  "953": "fun",
  "954": "ГҗВҝГҗВөГ‘оӮҖ",
  "955": "ans",
  "956": "ГҗВҫГ‘оӮҒ",
  "957": ".length",
  "958": "\\\";\\nfor",
  "959": "<vector>\\n#include<",
  "960": "ok",
  "961": "Number",
  "962": "Г‘оӮҲГҗВё",
  "963": "ircle",
  "964": "sc",
  "965": "Arr",
  "966": "constoverride",
  "967": "ГҗВҪГҗВө",
  "968": "<algorithm",
  "969": ".\\\"<<",
  "970": "[j]",
  "971": "case",
  "972": "(x",
  "973": "});\\n",
  "974": "pair",
  "975": "adi",
  "976": "log",
  "977": "}\\nstd::cout",
  "978": "for(inti",
  "979": "rono::",
  "980": "tainer",
  "981": "ms",
  "982": "<<\\\"ГҗоӮһ",
  "983": "ug",
  "984": ")=",
  "985": "Resource",
  "986": ".h",
  "987": "elseif",
  "988": "Г‘оӮҒГ‘оӮӮГ‘оӮҖ",
  "989": "thread",
  "990": "}\\ncout",
  "991": "nullptr",
  "992": "data.",
  "993": "Id",
  "994": "Sh",
  "995": "\\\"ГҗоӮқ",
  "996": "Pr",
  "997": "();\\n}\\n",
  "998": "\\npublic:\\n",
  "999": "?\\\"",
  "1000": "',",
  "1001": "ГҗВҪГҗВ°Г‘оӮҮ",
  "1002": "==0)",
  "1003": "[1]",
  "1004": "Te",
  "1005": "mutex",
  "1006": "_cast<",
  "1007": "y=",
  "1008": "ГҗВҪГҗВҫ",
  "1009": "move(",
  "1010": "(conststd::string&",
  "1011": "out",
  "1012": "duct",
  "1013": ")){\\n",
  "1014": "Г‘оӮӮГҗВҫГ‘оӮҖ",
  "1015": "w(",
  "1016": "=1",
  "1017": "ГҗВҪГҗВ°Г‘оӮҸ",
  "1018": "1;",
  "1019": "vector<int>",
  "1020": "arg",
  "1021": "graph",
  "1022": "ГҗоӮқ",
  "1023": "Array",
  "1024": "vice",
  "1025": "amount",
  "1026": "tern",
  "1027": "(conststring&",
  "1028": "<iostream>\\n#include<c",
  "1029": "Node*",
  "1030": ";\\nreturn",
  "1031": "s<<",
  "1032": "=(",
  "1033": "ivate",
  "1034": "ip",
  "1035": "Ref",
  "1036": "q.",
  "1037": "make_unique",
  "1038": "ГҗВ°Г‘оӮҒГ‘оӮҒ",
  "1039": "String",
  "1040": ",double",
  "1041": "ГҗВ°ГҗВҪГҗВёГҗВө",
  "1042": "2]",
  "1043": "\\\";",
  "1044": "radi",
  "1045": ";++",
  "1046": "ГҗВ»ГҗВөГҗВј",
  "1047": "To",
  "1048": "SI",
  "1049": ");\\nstd::cout",
  "1050": "Vector",
  "1051": "empty())",
  "1052": "private",
  "1053": "j=",
  "1054": "by",
  "1055": "if(!",
  "1056": "ГҗоӮ ",
  "1057": "event",
  "1058": ");",
  "1059": "ГҗВҫГ‘оӮҒГҗВ»ГҗВө",
  "1060": "{1,",
  "1061": "ГҗВ»ГҗВөГҗВјГҗВөГҗВҪГ‘оӮӮ",
  "1062": "Size",
  "1063": "\\\"C",
  "1064": "Bo",
  "1065": ");\\ncout",
  "1066": "Г‘оӮҖГҗВ°ГҗВ·",
  "1067": "<iostream>\\n#include<vector>\\n#include",
  "1068": "x=",
  "1069": "Ob",
  "1070": "ject",
  "1071": "<<\\\")",
  "1072": "memory",
  "1073": "template<typenameT",
  "1074": "im",
  "1075": "Г‘оӮҖГҗВё",
  "1076": "\\\"A",
  "1077": "\\nbool",
  "1078": "ho",
  "1079": "{\\nstd::string",
  "1080": "ГҗВҪГ‘оӮӢГҗВө",
  "1081": "alc",
  "1082": "Г‘оӮғГҗВј",
  "1083": "real",
  "1084": "Log",
  "1085": "inser",
  "1086": "{\\nstring",
  "1087": "\\nstd::",
  "1088": "<iostream>\\n\\nint",
  "1089": "#include<iostream>\\n\\nint",
  "1090": "rom",
  "1091": "y(",
  "1092": "ГҗоӮҡ",
  "1093": "unique_ptr<",
  "1094": "close",
  "1095": "ET",
  "1096": "make_unique<",
  "1097": "a=",
  "1098": "ib",
  "1099": "private:\\n",
  "1100": "dp",
  "1101": "we",
  "1102": "queue",
  "1103": "')",
  "1104": "ST",
  "1105": "for(const",
  "1106": "Complex",
  "1107": "other)const",
  "1108": "1;\\n}\\n",
  "1109": "endl;",
  "1110": "En",
  "1111": "ception",
  "1112": "year",
  "1113": "sock",
  "1114": "\\\"+",
  "1115": "chrono::",
  "1116": "Date",
  "1117": "unordered_",
  "1118": "1<<",
  "1119": "b)",
  "1120": "<iostream>\\n\\nintmain()",
  "1121": "tx",
  "1122": "<<\\\"ГҗоӮ ",
  "1123": "Do",
  "1124": "returnfalse;\\n",
  "1125": "ГҗВҫГҗВ»Г‘оӮҢГҗВ·",
  "1126": "<<*",
  "1127": "alloc",
  "1128": "\\\"-",
  "1129": "msg",
  "1130": ");\\nreturn",
  "1131": "name<<",
  "1132": ".h>\\n#include",
  "1133": "ГҗВ°:",
  "1134": "*ptr",
  "1135": "und",
  "1136": "constexpr",
  "1137": "has",
  "1138": "ГҗВ°\\n",
  "1139": "\\\"\\n",
  "1140": "Time",
  "1141": "i){\\n",
  "1142": "_v",
  "1143": "cache",
  "1144": "12",
  "1145": "ugin",
  "1146": "virtualvoid",
  "1147": "ZE",
  "1148": ";\\n}\\n\\nintmain()",
  "1149": "size_ti",
  "1150": "(constauto&",
  "1151": "height",
  "1152": "//ГҗВЎ",
  "1153": "bin",
  "1154": "{\\nprivate:\\n",
  "1155": "<<\\\"ГҗоӮ”",
  "1156": "x<<",
  "1157": "id(",
  "1158": "{\\nfor",
  "1159": "*th",
  "1160": "Г‘оӮҒГҗВҝ",
  "1161": "n;",
  "1162": "sw",
  "1163": "result;\\n",
  "1164": "top",
  "1165": "Г‘оӮҶГҗВёГҗВё",
  "1166": "++i)",
  "1167": "Г‘оӮҚГҗВ»ГҗВөГҗВјГҗВөГҗВҪГ‘оӮӮ",
  "1168": "b=",
  "1169": "Г‘оӮҒГ‘оӮӢ",
  "1170": "ant",
  "1171": "fe",
  "1172": "\\\\n\\\";\\n",
  "1173": ".push_back(",
  "1174": "Г‘оӮҒГ‘оӮҸ",
  "1175": "sa",
  "1176": "fault",
  "1177": "file.",
  "1178": "wr",
  "1179": "s:",
  "1180": "<iostream>\\n#include<string>\\n#include",
  "1181": "_error",
  "1182": "Г‘оӮӢГ‘оӮӮ",
  "1183": "function",
  "1184": "RE",
  "1185": "5);\\n",
  "1186": "=true;\\n",
  "1187": "=='",
  "1188": "std::cin",
  "1189": "ill",
  "1190": "{\\nthrow",
  "1191": "<cmath",
  "1192": "Matr",
  "1193": "<0)",
  "1194": "Г‘оӮ…ГҗВҫГҗВҙ",
  "1195": "ГҗВёГ‘оӮҮ",
  "1196": "Matrix",
  "1197": "atch",
  "1198": "stem",
  "1199": "message",
  "1200": "ГҗВҝГҗВҫГҗВ»",
  "1201": "Pl",
  "1202": "list",
  "1203": "matrix",
  "1204": "default",
  "1205": "(a",
  "1206": "'\\\"",
  "1207": "ange",
  "1208": "ep",
  "1209": "nection",
  "1210": "{}\\n\\n",
  "1211": "&operator",
  "1212": "ГҗВ°Г‘оӮҒГ‘оӮҒГҗВёГҗВІ",
  "1213": "ГҗоӮҗ",
  "1214": "Shape",
  "1215": "alance",
  "1216": "pattern",
  "1217": "fig",
  "1218": "<<c",
  "1219": "\\\"ГҗоӮң",
  "1220": "std::cin>>",
  "1221": "0;\\n\\n",
  "1222": "0x",
  "1223": "','",
  "1224": "igit",
  "1225": "value)",
  "1226": "Hel",
  "1227": "SIZE",
  "1228": "ГҗВөГ‘оӮҒГ‘оӮӮГҗВІ",
  "1229": "\\\"=",
  "1230": "\\nauto",
  "1231": "date",
  "1232": "month",
  "1233": "=false;\\n",
  "1234": "ГҗВҪГ‘оӮӢГ‘оӮ…",
  "1235": "<int>",
  "1236": "ra",
  "1237": "ГҗВў",
  "1238": "{\\nauto",
  "1239": "ec",
  "1240": "15",
  "1241": "shared_",
  "1242": "++;\\n}\\n",
  "1243": "fre",
  "1244": "byte",
  "1245": "s\\\"",
  "1246": "Le",
  "1247": "(\\\"<<",
  "1248": "inal",
  "1249": "Th",
  "1250": ";\\ndouble",
  "1251": "<<\\\"ГҗоӮқ",
  "1252": "<<x",
  "1253": "ГҗВҫГҗВ·ГҗВҙ",
  "1254": "Г‘оӮғГҗВ»",
  "1255": "<<name",
  "1256": "Г‘оӮҒГ‘оӮӢГҗВ»",
  "1257": "Г‘оӮғГҗВҪ",
  "1258": "{\\n//",
  "1259": "Г‘оӮҲГҗВёГҗВұ",
  "1260": "with",
  "1261": "Handler",
  "1262": ",const",
  "1263": "a<<",
  "1264": "pos",
  "1265": "!\\\"",
  "1266": "2:",
  "1267": "Circle",
  "1268": "MA",
  "1269": "Point",
  "1270": "override{",
  "1271": "alcul",
  "1272": "point",
  "1273": ".begin(),",
  "1274": "ГҗоӮ•",
  "1275": "Per",
  "1276": "Ac",
  "1277": "ГҗВҫГ‘оӮҮ",
  "1278": "++i){\\n",
  "1279": "empty()){\\n",
  "1280": "ГҗВ·ГҗВҪГҗВ°Г‘оӮҮ",
  "1281": "ГҗВ°Г‘оӮҶГҗВёГ‘оӮҸ",
  "1282": "ER",
  "1283": "<<b",
  "1284": "Г‘оӮҖГҗВҫГҗВІГҗВөГ‘оӮҖ",
  "1285": "try",
  "1286": "<<\\\"ГҗоӮң",
  "1287": "longlong",
  "1288": "(i",
  "1289": "return1;\\n",
  "1290": "n)",
  "1291": "ild",
  "1292": "!\\\"<<",
  "1293": "<<\\\"ГҗоӮҡ",
  "1294": "uard",
  "1295": "base",
  "1296": "ГҗоӮң",
  "1297": "e.",
  "1298": "double>",
  "1299": "pop",
  "1300": "s;",
  "1301": "[2]",
  "1302": "obj",
  "1303": "T_",
  "1304": "<<\\\":",
  "1305": "b;\\n",
  "1306": "ГҗВ°Г‘оӮӮГҗВөГҗВ»Г‘оӮҢ",
  "1307": "void*",
  "1308": "99",
  "1309": "Ne",
  "1310": "=&",
  "1311": "x,",
  "1312": "lag",
  "1313": "Wor",
  "1314": "delete[]",
  "1315": "->get",
  "1316": "next",
  "1317": "Г‘оӮҒГҗВёГҗВј",
  "1318": "{\\\"",
  "1319": "all",
  "1320": "LE",
  "1321": "4.",
  "1322": "(size_t",
  "1323": "j<",
  "1324": "n=",
  "1325": "from",
  "1326": "={1,",
  "1327": "\\\");\\n}\\n",
  "1328": "Task",
  "1329": "result=",
  "1330": "e)",
  "1331": "},\\n",
  "1332": "ГҗВәГҗВ»",
  "1333": "false;\\n}\\n",
  "1334": "3);\\n",
  "1335": "Logger",
  "1336": "quest",
  "1337": "*other.",
  "1338": "Container",
  "1339": "Hello",
  "1340": "ГҗВ°\\\"",
  "1341": "=1;",
  "1342": "exec",
  "1343": "User",
  "1344": "int,",
  "1345": "Ch",
  "1346": "uint",
  "1347": "2<<",
  "1348": "dy",
  "1349": "setw(",
  "1350": "c;\\n",
  "1351": "Г‘оӮҖГҗВ°ГҗВІ",
  "1352": ".second",
  "1353": "Info",
  "1354": "5.",
  "1355": "Or",
  "1356": "Event",
  "1357": "unordered_map",
  "1358": "area",
  "1359": "reg",
  "1360": "<<i",
  "1361": "ГҗоӮҹГ‘оӮҖГҗВҫГҗВІГҗВөГ‘оӮҖ",
  "1362": "idth",
  "1363": "])",
  "1364": "<<\\\"ГҗоӮҳ",
  "1365": "it=",
  "1366": "_string",
  "1367": "3)",
  "1368": "find(",
  "1369": "flo",
  "1370": "\\\")\\\"",
  "1371": "ГҗВҝГҗВҫ",
  "1372": "->left",
  "1373": "process",
  "1374": "sq",
  "1375": "signed",
  "1376": "catch",
  "1377": "\\nstatic",
  "1378": "<<\\\")\\\"",
  "1379": "\\\")\\\"<<",
  "1380": "{1,2,",
  "1381": "ГҗВјГҗВ°Г‘оӮҒГ‘оӮҒГҗВёГҗВІ",
  "1382": "_addr",
  "1383": "(){",
  "1384": "//ГҗоӮһ",
  "1385": "char*",
  "1386": "\\\");\\n\\n",
  "1387": "=2",
  "1388": "iority",
  "1389": "arch",
  "1390": "Г‘оӮғГҗВҙ",
  "1391": "eff",
  "1392": "'\\\"<<",
  "1393": "//ГҗоӮ”",
  "1394": "Book",
  "1395": "\\n\\n",
  "1396": "Г‘оӮҒГ‘оӮҒГ‘оӮӢГҗВ»",
  "1397": "Name()",
  "1398": "<size",
  "1399": "cy",
  "1400": "}catch",
  "1401": "<<a",
  "1402": "ON",
  "1403": "Json",
  "1404": "runtime",
  "1405": "value;\\n",
  "1406": "ition",
  "1407": "visited",
  "1408": "//ГҗоӮ’",
  "1409": "ГўоӮ•",
  "1410": "(m",
  "1411": "std::endl;\\n}",
  "1412": "runtime_error",
  "1413": "ry",
  "1414": "Г‘оӮғГ‘оӮҺ",
  "1415": "its",
  "1416": "Г‘оӮғГҗВҪГҗВә",
  "1417": "1:",
  "1418": "endl;\\n}",
  "1419": "()=",
  "1420": "CK",
  "1421": "<string>\\n#include<",
  "1422": ",\\n",
  "1423": "width",
  "1424": "<string>\\nusing",
  "1425": "<string>\\nusingnamespace",
  "1426": "\\\"]",
  "1427": "mmand",
  "1428": "ГҗВ°Г‘оӮҸ",
  "1429": ".h>\\n#include<",
  "1430": "ГҗВ°ГҗВ»Г‘оӮҢ",
  "1431": "\\\"[",
  "1432": "<iostream>\\n#include<cmath",
  "1433": "&e)",
  "1434": "<vector>\\n#include<algorithm",
  "1435": ".add",
  "1436": "2,3,",
  "1437": "T>\\n",
  "1438": "value<<",
  "1439": "ГҗВ°ГҗВұГҗВҫГ‘оӮӮ",
  "1440": "intn",
  "1441": "try{\\n",
  "1442": "catch(const",
  "1443": "e){\\n",
  "1444": "(2",
  "1445": "=1;\\n",
  "1446": "create",
  "1447": "}\\nint",
  "1448": "size;",
  "1449": "sqr",
  "1450": "unsigned",
  "1451": "product",
  "1452": ",std::",
  "1453": "minator",
  "1454": "\\nstring",
  "1455": "Plugin",
  "1456": "0;\\nvirtual",
  "1457": "\\\"S",
  "1458": "shared",
  "1459": "1;i",
  "1460": "\\\"ГҗоӮҹГҗВҫГ‘оӮҒГҗВ»ГҗВө",
  "1461": "<<\\\"ГҗоӮҹГҗВҫГ‘оӮҒГҗВ»ГҗВө",
  "1462": "<memory",
  "1463": "Visitor",
  "1464": "5;\\n",
  "1465": "[i][j]",
  "1466": "By",
  "1467": "Г‘оӮҢГ‘оӮӮ",
  "1468": "i<=",
  "1469": ".first",
  "1470": "_fd,",
  "1471": "template<typenameT>\\n",
  "1472": "size()<<",
  "1473": "last",
  "1474": "ari",
  "1475": "student",
  "1476": "ph",
  "1477": "EN",
  "1478": "std::string>",
  "1479": "shared_ptr<",
  "1480": "Sor",
  "1481": "ГўоӮ•оӮҗ",
  "1482": "boolis",
  "1483": "voidprint()",
  "1484": "x)",
  "1485": "=arr",
  "1486": "ГҗВІГ‘оӮҖ",
  "1487": "<int,",
  "1488": "opt",
  "1489": "Res",
  "1490": "\\\"(",
  "1491": "MAX",
  "1492": "client",
  "1493": "Expression",
  "1494": "ГўоӮ•оӮҗГўоӮ•оӮҗ",
  "1495": "typeid(",
  "1496": "All",
  "1497": "iginal",
  "1498": "&)",
  "1499": "<<\\\"ГҗВў",
  "1500": "block",
  "1501": "8,",
  "1502": "j++)",
  "1503": "<<\\\"C",
  "1504": "->right",
  "1505": "bu",
  "1506": "account",
  "1507": "[3",
  "1508": "value){\\n",
  "1509": "denominator",
  "1510": "mutex>",
  "1511": "handler",
  "1512": "s_",
  "1513": "<n;",
  "1514": "Tree",
  "1515": "tit",
  "1516": "t.",
  "1517": "write",
  "1518": "[i]=",
  "1519": ">0)",
  "1520": "0};\\n",
  "1521": "An",
  "1522": "[i]<<",
  "1523": "},{",
  "1524": "ГҗоӮҹГ‘оӮҖГҗВёГҗВј",
  "1525": "ГҗВ»ГҗВё",
  "1526": "valid",
  "1527": "ting",
  "1528": "book",
  "1529": "(d",
  "1530": "<f",
  "1531": "4);\\n",
  "1532": "<<e.",
  "1533": "j++){\\n",
  "1534": "system",
  "1535": "mutex>lock",
  "1536": "balance",
  "1537": "itial",
  "1538": "ГҗВ°:\\\"",
  "1539": "break;\\ncase",
  "1540": ">::",
  "1541": "=0,",
  "1542": "id<<",
  "1543": "leep",
  "1544": "7,",
  "1545": "';\\n",
  "1546": "dd",
  "1547": "Г‘оӮҮГҗВөГ‘оӮҖ",
  "1548": "\\nstd::string",
  "1549": "ail",
  "1550": "virtual~",
  "1551": "c)",
  "1552": "d;\\n",
  "1553": "{}\\nvoid",
  "1554": "<size;",
  "1555": "_clock::",
  "1556": "sleep",
  "1557": "s/",
  "1558": "{\\npublic:\\nvirtual",
  "1559": "Г‘оӮӮГ‘оӮҖ",
  "1560": "scr",
  "1561": "e.wh",
  "1562": "ГҗВјГҗВөГ‘оӮҖ",
  "1563": "p=",
  "1564": "port",
  "1565": "ios::",
  "1566": "s\\\"<<",
  "1567": "Message",
  "1568": "Г‘оӮӢГҗВІ",
  "1569": "print()const",
  "1570": "ГҗВҪГҗВҫГҗВіГҗВҫ",
  "1571": "Г‘оӮӢГ‘оӮӮГ‘оӮҢ",
  "1572": "Sub",
  "1573": "0;j",
  "1574": "<<e.wh",
  "1575": "e.what()",
  "1576": "<<e.what()",
  "1577": "e.what()<<",
  "1578": "\\\"F",
  "1579": "ГҗВҪГ‘оӮӢГҗВј",
  "1580": "illisecond",
  "1581": "3.1",
  "1582": "int&",
  "1583": "<<\\\"[",
  "1584": "execute",
  "1585": "LO",
  "1586": "Fun",
  "1587": "\\\"M",
  "1588": "(str",
  "1589": "Г‘оӮҮГҗВөГ‘оӮӮ",
  "1590": "5)",
  "1591": "*p",
  "1592": "]){\\n",
  "1593": "ГҗВІГҗВөГ‘оӮҖ",
  "1594": "this_thread",
  "1595": "this_thread::",
  "1596": "to_string",
  "1597": "y<<",
  "1598": "Г‘оӮғГ‘оӮҖ",
  "1599": "=default",
  "1600": "s.size()",
  "1601": "\\\":\\\"",
  "1602": "intget",
  "1603": "AL",
  "1604": "binary",
  "1605": "0&&",
  "1606": "//ГҗоӮҳ",
  "1607": "work",
  "1608": "ГҗВЈ",
  "1609": "<<f",
  "1610": "data;\\n",
  "1611": "ptr=",
  "1612": "size=",
  "1613": "Г‘оӮҖГҗВ°ГҗВұГҗВҫГ‘оӮӮ",
  "1614": "Index",
  "1615": "break;\\n}\\n",
  "1616": "2){\\n",
  "1617": "3=",
  "1618": "ГҗВҫГҗВ»ГҗВёГ‘оӮҮГҗВөГ‘оӮҒГ‘оӮӮГҗВІ",
  "1619": ".name",
  "1620": "indow",
  "1621": "<std::",
  "1622": "c=",
  "1623": "acc",
  "1624": "Man",
  "1625": "arr[i]",
  "1626": "Г‘оӮғГ‘оӮҒ",
  "1627": "swap",
  "1628": "ГҗВұГ‘оӮӢГ‘оӮӮГ‘оӮҢ",
  "1629": "Г‘оӮҖГҗВҫГҗВІГҗВ°ГҗВҪ",
  "1630": "0;\\n}\\n",
  "1631": "(f",
  "1632": "py",
  "1633": "//ГҗоӮҹГ‘оӮҖГҗВҫГҗВІГҗВөГ‘оӮҖ",
  "1634": "Rectangle",
  "1635": "angle",
  "1636": "Product",
  "1637": "_in",
  "1638": "3,4,",
  "1639": "throwstd::",
  "1640": "voidset",
  "1641": "true;\\n}\\n",
  "1642": "returntrue;\\n",
  "1643": "pool",
  "1644": "price",
  "1645": "ultipl",
  "1646": "ГҗВөГ‘оӮҲ",
  "1647": "coeff",
  "1648": "Exception",
  "1649": "Г‘оӮҮГҗВёГ‘оӮҒГҗВ»ГҗВҫ",
  "1650": ")/",
  "1651": "v)",
  "1652": "<<\\\"=",
  "1653": "\\ntemplate<typename",
  "1654": "Pool",
  "1655": "stringget",
  "1656": "\\\";\\ncin",
  "1657": "millisecond",
  "1658": "3;\\n",
  "1659": "Result",
  "1660": "element",
  "1661": "this_thread::sleep",
  "1662": "+\\\"",
  "1663": "ixed",
  "1664": "guard",
  "1665": "open",
  "1666": "()override",
  "1667": "expr",
  "1668": "b,",
  "1669": "ГҗВәГҗВҫГҗВҪ",
  "1670": "Int",
  "1671": "Er",
  "1672": "5};\\n",
  "1673": "Г‘оӮҮГҗВөГ‘оӮҖГҗВөГҗВ·",
  "1674": "1){\\n",
  "1675": "r<<",
  "1676": "=i",
  "1677": "s:\\\"",
  "1678": "nam",
  "1679": "Error",
  "1680": "ГҗВӨ",
  "1681": "returnstd::",
  "1682": "<<endl;",
  "1683": "namic",
  "1684": "ld",
  "1685": "weight",
  "1686": "size;i++)",
  "1687": "for(constauto&",
  "1688": "\\\";\\nstd::cin",
  "1689": "i<<",
  "1690": "ГҗоӮҹГ‘оӮҖГҗВҫГҗВІГҗВөГ‘оӮҖГҗВәГҗВ°",
  "1691": "AB",
  "1692": "std::stringget",
  "1693": "'){\\n",
  "1694": "i+",
  "1695": "<<num",
  "1696": "<<value",
  "1697": "ГҗВҫГҗВ»ГҗВёГ‘оӮҮГҗВөГ‘оӮҒГ‘оӮӮГҗВІГҗВҫ",
  "1698": "RA",
  "1699": "std::endl;",
  "1700": "<<std::endl;",
  "1701": "insert(",
  "1702": "{\\npublic:\\nvoid",
  "1703": "returna",
  "1704": "<iostream>\\n\\nclass",
  "1705": ">&",
  "1706": "Г‘оӮ„ГҗВё",
  "1707": "Thread",
  "1708": "<<id",
  "1709": "Command",
  "1710": "pop();\\n",
  "1711": "\\nif(",
  "1712": "vail",
  "1713": ",\\\"",
  "1714": "c:",
  "1715": "andle",
  "1716": "1+",
  "1717": "calcul",
  "1718": "manager",
  "1719": "Ite",
  "1720": "value=",
  "1721": "print();\\n\\n",
  "1722": "OR",
  "1723": "item",
  "1724": "Г‘оӮғГҗВ»Г‘оӮҢГ‘оӮӮ",
  "1725": "16",
  "1726": "y;\\n",
  "1727": "op",
  "1728": "original",
  "1729": "<<d",
  "1730": "Г‘оӮҖГҗВөГҗВҙ",
  "1731": "<<p",
  "1732": "Service",
  "1733": ">\\n#include<vector>\\n#include",
  "1734": "ГҗВәГҗВҫГҗВј",
  "1735": "n;i++)",
  "1736": "Proce",
  "1737": ")override",
  "1738": "F_",
  "1739": "0||",
  "1740": "autoit",
  "1741": "\\nwhile",
  "1742": "(&",
  "1743": "#include<iostream>\\n\\nclass",
  "1744": "(p",
  "1745": "=a",
  "1746": "Г‘оӮғГҗВјГҗВј",
  "1747": "ГҗВөГ‘оӮӮГҗВҫГҗВҙ",
  "1748": "ГҗВөГҗВ·Г‘оӮғГҗВ»Г‘оӮҢГ‘оӮӮ",
  "1749": "ГҗВөГҗВ·Г‘оӮғГҗВ»Г‘оӮҢГ‘оӮӮГҗВ°Г‘оӮӮ",
  "1750": "lock_",
  "1751": "ГҗВөГҗВҪГҗВёГҗВө:",
  "1752": ".sin",
  "1753": "Valid",
  "1754": "max_",
  "1755": "<<s",
  "1756": "Arg",
  "1757": "adj",
  "1758": "radius",
  "1759": "search",
  "1760": "Г‘оӮғГҗВәГҗВ°ГҗВ·",
  "1761": "=4",
  "1762": "i;\\n",
  "1763": "_str",
  "1764": "ning",
  "1765": "\\\";\\nstd::cout",
  "1766": "hour",
  "1767": "32",
  "1768": "rever",
  "1769": "dra",
  "1770": "exception",
  "1771": "cerr",
  "1772": "cerr<<",
  "1773": "E_",
  "1774": "ek",
  "1775": "b<<",
  "1776": "='",
  "1777": "<<\\\"A",
  "1778": "*b",
  "1779": "==\\\"",
  "1780": "1(",
  "1781": "duration",
  "1782": "now",
  "1783": "Student",
  "1784": "3;",
  "1785": "run",
  "1786": "num<<",
  "1787": "def",
  "1788": "();\\nreturn",
  "1789": "return\\\"",
  "1790": ")\\\"",
  "1791": "\\\"N",
  "1792": "sys/",
  "1793": "Observer",
  "1794": "static_cast<",
  "1795": "<sys/",
  "1796": "Г‘оӮғГҗВҪГҗВәГ‘оӮҶГҗВёГ‘оӮҸ",
  "1797": "ГҗВҫГ‘оӮҖГ‘оӮӮГҗВё",
  "1798": "substr",
  "1799": "twork",
  "1800": "TI",
  "1801": "Config",
  "1802": "rc",
  "1803": "push(",
  "1804": "ГҗВІГҗВҫГҗВ»",
  "1805": "Ele",
  "1806": "}\\nbool",
  "1807": "}\\nif",
  "1808": "2(",
  "1809": "s;\\n\\n",
  "1810": "for(size_t",
  "1811": "arr[",
  "1812": "\\\";\\n\\n",
  "1813": "ГҗоӮ—",
  "1814": "2D",
  "1815": "<<n",
  "1816": "{\\nchar",
  "1817": "order",
  "1818": "Reg",
  "1819": "(intj",
  "1820": "jo",
  "1821": "4)",
  "1822": "=delete",
  "1823": "Concrete",
  "1824": "lock_guard",
  "1825": "123",
  "1826": "Г‘оӮӮГҗВёГҗВҝ",
  "1827": "Г‘оӮҒГ‘оӮ…ГҗВҫГҗВҙ",
  "1828": "make_shared",
  "1829": "y)",
  "1830": "Connection",
  "1831": ".size()",
  "1832": "\\\"Hello",
  "1833": "endl;\\nfor",
  "1834": "Г‘оӮғГҗВі",
  "1835": "x+",
  "1836": "Length",
  "1837": "ГҗВҫГҗВұГҗВ°ГҗВІ",
  "1838": "<iostream>\\n#include<string>\\nusing",
  "1839": "20",
  "1840": "1*",
  "1841": "<algorithm>\\n#include",
  "1842": "data)",
  "1843": "});\\n\\n",
  "1844": "shape",
  "1845": "fr",
  "1846": "2;",
  "1847": "56",
  "1848": "nullptr)",
  "1849": "nullptr;\\n",
  "1850": "serial",
  "1851": "\\n:",
  "1852": "d=",
  "1853": "Account",
  "1854": "Test",
  "1855": "clear",
  "1856": "Que",
  "1857": "ГҗВҙГ‘оӮҖ",
  "1858": "this",
  "1859": "observer",
  "1860": "<cstring",
  "1861": "Ye",
  "1862": "std::endl;\\n}\\n};\\n\\nint",
  "1863": ")\\\"<<",
  "1864": "for(auto&",
  "1865": "Г‘оӮҒГҗВө",
  "1866": "safe",
  "1867": "ГҗВҫГҗВ»ГҗВ¶",
  "1868": "booloperator",
  "1869": "(s",
  "1870": "found",
  "1871": "ative",
  "1872": "\\\";\\ncout",
  "1873": "b){\\n",
  "1874": "[v",
  "1875": "ax",
  "1876": "high",
  "1877": "Г‘оӮҲГҗВёГҗВұГҗВәГҗВ°:",
  "1878": "name;\\n",
  "1879": "mic",
  "1880": "=0.",
  "1881": "Fraction",
  "1882": "Name()const",
  "1883": "ID",
  "1884": "():",
  "1885": "minute",
  "1886": "<memory>\\n#include",
  "1887": "num;\\n",
  "1888": "protected:\\n",
  "1889": "std::size_t",
  "1890": "{\\nstd::vector<int>",
  "1891": "sum=",
  "1892": "}\\ndouble",
  "1893": "Manager",
  "1894": "ГҗВҫГҗВіГҗВҫ",
  "1895": "returnresult;\\n",
  "1896": "<algorithm>\\nusing",
  "1897": "<algorithm>\\nusingnamespace",
  "1898": "&)=",
  "1899": "mid",
  "1900": "SO",
  "1901": "ГҗВјГҗВҫГҗВ¶",
  "1902": "ГҗВ°ГҗВ№Г‘оӮӮ",
  "1903": "voidprint",
  "1904": "pha",
  "1905": "endl;\\n}\\n};\\n\\nint",
  "1906": "edge",
  "1907": "txt",
  "1908": "Un",
  "1909": "capac",
  "1910": ".length()",
  "1911": "x;\\n",
  "1912": "ingleton",
  "1913": "newint",
  "1914": "ГҗВ°ГҗВ№ГҗВ»",
  "1915": "ГҗоӮӣ",
  "1916": "Г‘оӮҒГҗВҫГҗВ·ГҗВҙ",
  "1917": "str)",
  "1918": "--;\\n",
  "1919": "Order",
  "1920": "{'",
  "1921": "sign",
  "1922": "std::endl;\\nfor",
  "1923": "Г‘оӮҠ",
  "1924": "uc",
  "1925": "<<get",
  "1926": "6,",
  "1927": "nc",
  "1928": "<fstream",
  "1929": "close();\\n",
  "1930": "num:",
  "1931": "ГҗВәГ‘оӮғ",
  "1932": "ighbor",
  "1933": "AR",
  "1934": "Ke",
  "1935": "title",
  "1936": "Add",
  "1937": "mploye",
  "1938": "{\\nvector<int>",
  "1939": "2)<<",
  "1940": "Ro",
  "1941": "int[",
  "1942": "m=",
  "1943": "flag",
  "1944": "<<\\\"S",
  "1945": "+1,",
  "1946": "r)",
  "1947": "m.",
  "1948": "ГҗВөГҗВәГ‘оӮӮ",
  "1949": "<<\\\"ГҗоӮ—",
  "1950": "ГҗВҪГҗВ°ГҗВ№ГҗВҙ",
  "1951": "(b",
  "1952": "ГҗВ°ГҗВҪГ‘оӮӮ",
  "1953": "Г‘оӮғГ‘оӮӮ",
  "1954": "=10;\\n",
  "1955": "doubleget",
  "1956": "child",
  "1957": "Г‘оӮҸГҗВІ",
  "1958": "newNode",
  "1959": "input",
  "1960": "sockaddr",
  "1961": "mial",
  "1962": "Cache",
  "1963": "\\\\t",
  "1964": "1-",
  "1965": "ГҗВөГҗВҪ\\\"",
  "1966": "\\\"ГҗоӮҳГ‘оӮҒГ‘оӮ…ГҗВҫГҗВҙ",
  "1967": "ify",
  "1968": "n){\\n",
  "1969": "\\\"'",
  "1970": "<0",
  "1971": "const=",
  "1972": "n,",
  "1973": "AF_",
  "1974": "\\\");\\nreturn",
  "1975": "v.",
  "1976": "std::chrono::",
  "1977": "com",
  "1978": "ucce",
  "1979": "<<str",
  "1980": "staticvoid",
  "1981": "<<\\\"ГҗоӮҳГ‘оӮҒГ‘оӮ…ГҗВҫГҗВҙ",
  "1982": "<<\\\"]",
  "1983": "ly",
  "1984": "<<y",
  "1985": "<<result",
  "1986": "=5;\\n",
  "1987": "friend",
  "1988": "ГҗВҫГҗВІ\\n",
  "1989": "mployee",
  "1990": "vailable",
  "1991": "<iostream>\\n#include<fstream",
  "1992": "(intnum",
  "1993": "0);\\n\\n",
  "1994": "Г‘оӮҒГҗВҫГ‘оӮҖГ‘оӮӮГҗВё",
  "1995": "empl",
  "1996": "emplace",
  "1997": "instance",
  "1998": "He",
  "1999": "Item",
  "2000": "ГҗВҙГҗВҫГҗВ»ГҗВ¶",
  "2001": "(root",
  "2002": "<<\\\"-",
  "2003": "(size_ti",
  "2004": "ГҗоӮ’Г‘оӮӢ",
  "2005": "MAX_",
  "2006": "Г‘оӮҒГҗВёГҗВјГҗВІГҗВҫГҗВ»",
  "2007": "calculate",
  "2008": "ГҗВұГҗВ°ГҗВ№Г‘оӮӮ",
  "2009": "\\\"a",
  "2010": "Singleton",
  "2011": "*a",
  "2012": "INET",
  "2013": "newint[",
  "2014": "Г‘оӮҺГ‘оӮҮ",
  "2015": "<<\\\"F",
  "2016": "Cl",
  "2017": "ГҗВ°\\\":",
  "2018": "Г‘оӮғГ‘оӮҮ",
  "2019": "}\\n~",
  "2020": "(T",
  "2021": "->second",
  "2022": "Г‘оӮҸГҗВөГҗВј",
  "2023": "AF_INET",
  "2024": "DE",
  "2025": "ank",
  "2026": "ГҗВҙГҗВІ",
  "2027": "Block",
  "2028": "n<<",
  "2029": "9,",
  "2030": "<<\\\"'",
  "2031": "{cout",
  "2032": "[3]",
  "2033": "nomial",
  "2034": "MP",
  "2035": "];\\n}\\n",
  "2036": "conststd::string&",
  "2037": "conststring&",
  "2038": "Wrap",
  "2039": "dest",
  "2040": "5;",
  "2041": "email",
  "2042": "ution",
  "2043": "request",
  "2044": "<<\\\"M",
  "2045": "data=",
  "2046": "Of",
  "2047": "_clock::now();\\n",
  "2048": "*c",
  "2049": "ГҗВЎГҗВҫГҗВ·ГҗВҙ",
  "2050": "{\\nprotected:\\n",
  "2051": "Object",
  "2052": "\\\"P",
  "2053": "Base{\\npublic:\\n",
  "2054": "b.",
  "2055": "{std::cout",
  "2056": "ГҗВҪГҗВҫГ‘оӮҒГ‘оӮӮГ‘оӮҢ",
  "2057": "ГҗоӮҳГ‘оӮҒГҗВҝГҗВҫГҗВ»Г‘оӮҢГҗВ·",
  "2058": "\\\"\\\\nГҗоӮҹ",
  "2059": "<<\\\"\\\\nГҗоӮҹ",
  "2060": "function<",
  "2061": ",&",
  "2062": ":name",
  "2063": "2:\\\"",
  "2064": "\\\"ГҗВ§",
  "2065": "\\\";\\n}",
  "2066": "indrome",
  "2067": "getName()",
  "2068": "streamfile",
  "2069": "<type",
  "2070": "{\\nresult",
  "2071": "intsize",
  "2072": "\\\"ГҗоӮһГҗВұ",
  "2073": "<<(is",
  "2074": "t)",
  "2075": "milliseconds(",
  "2076": "Qu",
  "2077": "Car",
  "2078": "ГҗВөГҗВҪГ‘оӮҢ",
  "2079": "count=",
  "2080": "//ГҗоӮҡ",
  "2081": "Ptr=",
  "2082": "uture",
  "2083": "str){\\n",
  "2084": ".empty())",
  "2085": "Г‘оӮүГҗВё",
  "2086": "join();\\n",
  "2087": "load",
  "2088": "ГҗВҝГҗВөГ‘оӮҖГҗВөГҗВј",
  "2089": "4;\\n",
  "2090": "Г‘оӮғГҗВіГҗВҫГҗВ»Г‘оӮҢ",
  "2091": "ГҗВәГ‘оӮҖ",
  "2092": "return;\\n}\\n",
  "2093": "ГҗоӮ‘",
  "2094": "!=0)",
  "2095": "Simple",
  "2096": "_fd);\\n",
  "2097": "t=",
  "2098": "ГҗВ°Г‘оӮҶГҗВёГҗВё",
  "2099": "Wrapper",
  "2100": "<<\\\"ГҗВ§",
  "2101": "dynamic",
  "2102": "handle",
  "2103": "initial",
  "2104": "}\\n};\\n",
  "2105": "ГҗВөГҗВҪГҗВёГҗВө:\\\"",
  "2106": "ГҗВҫГҗВҝГҗВё",
  "2107": "update",
  "2108": "Г‘оӮӢ\\n",
  "2109": "mod",
  "2110": "][",
  "2111": "//ГҗоӮқ",
  "2112": "<3;",
  "2113": "(0,",
  "2114": "Char",
  "2115": "Set",
  "2116": "Element",
  "2117": ":data",
  "2118": "m_",
  "2119": ">\\n#include<string>\\n#include",
  "2120": "wa",
  "2121": "for(size_ti",
  "2122": "vert",
  "2123": "om",
  "2124": "\\\"B",
  "2125": "0.0;\\n",
  "2126": "SS",
  "2127": "ГҗВёГҗВ·ГҗВј",
  "2128": "ГҗВҫГҗВІГҗВ°ГҗВҪГҗВёГҗВө",
  "2129": "ГҗВҙГҗВҫ",
  "2130": "if(n",
  "2131": "ific",
  "2132": "=c",
  "2133": "arr;\\n",
  "2134": "make_shared<",
  "2135": "name,",
  "2136": "noex",
  "2137": "Г‘оӮҒГ‘оӮӮГҗВІ",
  "2138": "<stdex",
  "2139": "<stdexcept",
  "2140": "exception&",
  "2141": "s()const",
  "2142": "//ГҗоӮҹГ‘оӮҖГҗВҫГҗВІГҗВөГ‘оӮҖГҗВәГҗВ°",
  "2143": "result+=",
  "2144": "Type::",
  "2145": "\\\"ГҗоӮһГ‘оӮҲГҗВёГҗВұГҗВәГҗВ°:",
  "2146": "*=",
  "2147": "{0,",
  "2148": "ГҗВөГҗВҪ\\\"<<",
  "2149": "ГҗВәГҗВҫГ‘оӮҖ",
  "2150": "ГҗВөГ‘оӮӮГ‘оӮҒГ‘оӮҸ",
  "2151": "}\\n}\\n\\nintmain()",
  "2152": "<<\\\"ГҗоӮһГҗВұ",
  "2153": "World",
  "2154": "Г‘оӮҸ:",
  "2155": "script",
  "2156": ">\\n\\nstruct",
  "2157": "decltype",
  "2158": "ГҗВ°Г‘оӮӮГ‘оӮҖГҗВёГ‘оӮҶ",
  "2159": "\\n~",
  "2160": "result;\\n}\\n",
  "2161": "<<\\\"ГҗоӮһГ‘оӮҲГҗВёГҗВұГҗВәГҗВ°:",
  "2162": "\\nconst",
  "2163": "TE",
  "2164": "exception&e)",
  "2165": "ГҗВ°ГҗВ·ГҗВјГҗВөГ‘оӮҖ",
  "2166": "fixed",
  "2167": "allocate",
  "2168": "std::runtime_error",
  "2169": "\\n}\\n",
  "2170": "ГҗВ°ГҗВәГ‘оӮҒГҗВёГҗВј",
  "2171": "ГҗВәГҗВ»Г‘оӮҺГ‘оӮҮ",
  "2172": "temp=",
  "2173": ".name()",
  "2174": ";}\\n};\\n\\nint",
  "2175": ";\\nif",
  "2176": "Packe",
  "2177": "3:",
  "2178": "ГҗВІГ‘оӮҖГҗВөГҗВј",
  "2179": "ГҗВҫГ‘оӮҖГҗВј",
  "2180": "ifstream",
  "2181": "current=",
  "2182": ".end(),",
  "2183": "Squ",
  "2184": "3D",
  "2185": "ГҗВөГ‘оӮү",
  "2186": "delete;\\n",
  "2187": "=delete;\\n",
  "2188": ".set",
  "2189": "Г‘оӮғГҗВҝ",
  "2190": "getName()const",
  "2191": "return*this;\\n",
  "2192": "ГҗВҙГҗВё",
  "2193": "std;\\n\\nstruct",
  "2194": "namespacestd;\\n\\nstruct",
  "2195": "thod",
  "2196": "addr.sin",
  "2197": "precision",
  "2198": "Args",
  "2199": "float",
  "2200": "<cmath>\\nusing",
  "2201": "<cmath>\\nusingnamespace",
  "2202": "<chrono",
  "2203": "<std::string,",
  "2204": "'||",
  "2205": "With",
  "2206": "1==",
  "2207": "+1;\\n",
  "2208": "valu",
  "2209": "T&",
  "2210": "ГҗоӮһГҗВұ",
  "2211": "2*",
  "2212": "T,",
  "2213": "<vector>\\nusing",
  "2214": "<vector>\\nusingnamespace",
  "2215": "lim",
  "2216": "getline",
  "2217": "<string,",
  "2218": "Vector2D",
  "2219": "std::make_unique<",
  "2220": "visit(",
  "2221": "Node(",
  "2222": "ational",
  "2223": "arr[i]<<",
  "2224": "Г‘оӮҺГ‘оӮӮ",
  "2225": "-=",
  "2226": "*this;\\n}\\n",
  "2227": "<iomanip",
  "2228": "start=",
  "2229": "Rational",
  "2230": "ical",
  "2231": "Г‘оӮ„ГҗВ°ГҗВ№ГҗВ»",
  "2232": "My",
  "2233": "heap",
  "2234": "\\\"x",
  "2235": "y,",
  "2236": "\\nfor(int",
  "2237": "returnx",
  "2238": "List",
  "2239": "<<arr[i]",
  "2240": "ГҗВ°Г‘оӮӮГ‘оӮҢ",
  "2241": "config",
  "2242": "We",
  "2243": "Г‘оӮҸГҗВј",
  "2244": "{\\nconst",
  "2245": "info",
  "2246": "ГҗВҫГ‘оӮү",
  "2247": "lib",
  "2248": "Г‘оӮҒГ‘оӮӮГҗВ°ГҗВҪГ‘оӮӮ",
  "2249": "level",
  "2250": "\\\"*",
  "2251": "setprecision",
  "2252": "RU",
  "2253": "_of",
  "2254": "intcount",
  "2255": ">>a",
  "2256": "exp",
  "2257": "ГҗВІГҗВҫГҗВ·",
  "2258": "itch",
  "2259": "free",
  "2260": "Pa",
  "2261": "=\\\"Hello",
  "2262": "intm",
  "2263": "operator=(const",
  "2264": ".name()<<",
  "2265": "ГҗВҫГ‘оӮҸ",
  "2266": "constint",
  "2267": "<iostream>\\n#include<cstring",
  "2268": "(conststd::",
  "2269": "Sa",
  "2270": "<string>\\n\\nclass",
  "2271": "<functional",
  "2272": "define",
  "2273": "container",
  "2274": "\\\"){\\n",
  "2275": "window",
  "2276": "fixed<<",
  "2277": "uffix",
  "2278": "=0)",
  "2279": "leag",
  "2280": "CK_",
  "2281": "a;\\n",
  "2282": "(1,",
  "2283": "\\\"ГҗВұГҗВ°ГҗВ№Г‘оӮӮ",
  "2284": "={\\n",
  "2285": "<thread",
  "2286": "arr=",
  "2287": "parse",
  "2288": "<fstream>\\n#include",
  "2289": "&operator=(const",
  "2290": "s.end())",
  "2291": "\\\"%",
  "2292": "0;\\nfor",
  "2293": "logger",
  "2294": "ss<<",
  "2295": "\\\"\\\"<<",
  "2296": "||c",
  "2297": "ifconstexpr",
  "2298": "#define",
  "2299": "ariable",
  "2300": "running",
  "2301": "+1",
  "2302": "gative",
  "2303": "\\\"D",
  "2304": "rypted",
  "2305": "//ГҗВЎГҗВҫГҗВ·ГҗВҙ",
  "2306": "can",
  "2307": "std::unique_ptr<",
  "2308": "]:",
  "2309": "}\\n\\npublic:\\n",
  "2310": "<=0)",
  "2311": "ГҗВөГҗВјГҗВҫГҗВҪ",
  "2312": "stream&",
  "2313": "ГҗВҪГҗВёГҗВ№",
  "2314": "ГҗВҫГҗВұГ‘оӮҠ",
  "2315": "-1){\\n",
  "2316": "c==",
  "2317": "Mone",
  "2318": "<1",
  "2319": "[i][j]=",
  "2320": "size){\\n",
  "2321": "evalu",
  "2322": "ME",
  "2323": "noexcept",
  "2324": "%2",
  "2325": "az",
  "2326": "voidadd",
  "2327": "if(i",
  "2328": "//ГҗВЈ",
  "2329": "league",
  "2330": "constchar*",
  "2331": "seconds",
  "2332": "signal",
  "2333": "L_",
  "2334": "Prime",
  "2335": "<<setw(",
  "2336": ".print();\\n",
  "2337": "{\\nfor(int",
  "2338": "x*",
  "2339": "id)",
  "2340": "ГҗВҪГ‘оӮӢГҗВ№ГҗВјГҗВ°Г‘оӮҒГ‘оӮҒГҗВёГҗВІ",
  "2341": "invalid_",
  "2342": "invalid_arg",
  "2343": "ГҗВөГҗВәГ‘оӮҒ",
  "2344": "s();\\n\\n",
  "2345": "ГҗВјГҗВ°Г‘оӮҒГ‘оӮҒГҗВёГҗВІ:",
  "2346": "<map",
  "2347": "-\\\"",
  "2348": "RO",
  "2349": "Sy",
  "2350": "Impl",
  "2351": "ГҗВҪГҗВёГҗВә",
  "2352": "result<<",
  "2353": ".print",
  "2354": "div",
  "2355": "t:",
  "2356": ".end())",
  "2357": "respon",
  "2358": "v=",
  "2359": "os",
  "2360": "'\\\\",
  "2361": "register",
  "2362": "(other.",
  "2363": "};\\nint",
  "2364": "+b",
  "2365": "1);\\n\\n",
  "2366": "switch",
  "2367": "Polynomial",
  "2368": "<<test",
  "2369": "Min",
  "2370": "text=",
  "2371": "ГҗоӮҡГҗВҫГҗВҪ",
  "2372": "serialize",
  "2373": "):\\\"",
  "2374": "AD",
  "2375": "UL",
  "2376": "<std::mutex>",
  "2377": "ING",
  "2378": "Expr",
  "2379": "ГҗВ°ГҗВјГҗВё",
  "2380": "i,",
  "2381": "\\\"ГҗоӮҹГ‘оӮҖ",
  "2382": "isO",
  "2383": "neighbor",
  "2384": "gy",
  "2385": "ГҗВҫГҗВІ:",
  "2386": "ue;\\n",
  "2387": "m)",
  "2388": "\\\"]=",
  "2389": "Memory",
  "2390": "std::setw(",
  "2391": "<<std::setw(",
  "2392": "Employee",
  "2393": "{\\ntry",
  "2394": "ГҗВјГҗВ°Г‘оӮҒГ‘оӮҒГҗВёГҗВІ:\\\";\\n",
  "2395": "].",
  "2396": "AN",
  "2397": "<iostream>\\n#include<fstream>\\n#include",
  "2398": "boolal",
  "2399": "intx",
  "2400": "ГҗоӮҹГ‘оӮҖ",
  "2401": "a+",
  "2402": "voiddisplay()",
  "2403": "<unordered_map",
  "2404": "-1)",
  "2405": "if(it",
  "2406": "<std::mutex>lock",
  "2407": "freq",
  "2408": "8_t",
  "2409": "ofstream",
  "2410": "ГҗВ°Г‘оӮҮ",
  "2411": "0;\\nint",
  "2412": "ility",
  "2413": "wn",
  "2414": "d)",
  "2415": "<<\\\"Derived",
  "2416": "node->",
  "2417": "ГҗВІГ‘оӮҒГҗВө",
  "2418": "<cctype",
  "2419": "os<<",
  "2420": "pq.",
  "2421": "evaluate",
  "2422": "ГҗВ»ГҗВөГҗВҪ",
  "2423": "s.end()){\\n",
  "2424": "CO",
  "2425": "hicle",
  "2426": "buffer[",
  "2427": "inta",
  "2428": "Г‘оӮӢГҗВ№",
  "2429": "{\\ncase",
  "2430": "4,5};\\n",
  "2431": "<<\\\"Base",
  "2432": "FI",
  "2433": "CT",
  "2434": "Г‘оӮӮГҗВҫ",
  "2435": "=other.",
  "2436": "+other.",
  "2437": "k=",
  "2438": "<cstd",
  "2439": "Max",
  "2440": "gree",
  "2441": "()==",
  "2442": "Hash",
  "2443": "18",
  "2444": "circle",
  "2445": ";\\n\\npublic:\\n",
  "2446": "local",
  "2447": "doc",
  "2448": "<iostream>\\n#include<cmath>\\nusing",
  "2449": "4,5,",
  "2450": "throwruntime_error",
  "2451": "Instance",
  "2452": "clear();\\n",
  "2453": ",0);\\n",
  "2454": "*)",
  "2455": "ГҗВҙГҗВ°ГҗВҪ",
  "2456": "Network",
  "2457": "FF",
  "2458": "vec=",
  "2459": "ГҗВҪГ‘оӮғГ‘оӮҺ",
  "2460": ":\\\"ГҗоӮқ",
  "2461": "sum+=",
  "2462": "succe",
  "2463": "Г‘оӮҒГҗВё",
  "2464": "perror(\\\"",
  "2465": "ГҗВҫГҗВ¶ГҗВёГ‘оӮӮГҗВөГҗВ»Г‘оӮҢ",
  "2466": "s:\\\"<<",
  "2467": "1;\\n\\n",
  "2468": "s.emplace",
  "2469": "<mutex>",
  "2470": "vector<string>",
  "2471": "':",
  "2472": "\\\"ГҗоӮ ГҗВөГҗВ·Г‘оӮғГҗВ»Г‘оӮҢГ‘оӮӮГҗВ°Г‘оӮӮ",
  "2473": "ГҗВӨГ‘оӮғГҗВҪГҗВәГ‘оӮҶГҗВёГ‘оӮҸ",
  "2474": "=100;\\n",
  "2475": "<<\\\"ГҗоӮҹГ‘оӮҖ",
  "2476": "==0",
  "2477": "{\\nint*",
  "2478": "Guard",
  "2479": "2-",
  "2480": "t,",
  "2481": "Ref=",
  "2482": "Count=",
  "2483": "scription",
  "2484": "Map",
  "2485": "\\\"/",
  "2486": "ГҗВөГҗВјГҗВҫГҗВҪГ‘оӮҒГ‘оӮӮГ‘оӮҖ",
  "2487": "for(charc",
  "2488": "normal",
  "2489": "da",
  "2490": "<<\\\"ГҗВЈ",
  "2491": "unordered_set",
  "2492": "System",
  "2493": "//ГҗоӮ ",
  "2494": "returndata",
  "2495": "a,int",
  "2496": "3)<<",
  "2497": "publicBase",
  "2498": "active",
  "2499": "Г‘оӮҮГҗВёГ‘оӮҒГҗВ»ГҗВҫ:",
  "2500": "Person",
  "2501": "connection",
  "2502": "alculator",
  "2503": "default;\\n",
