{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<OOV>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<START>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<END>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<OOV>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<PAD>": 0,
      "<OOV>": 1,
      "<START>": 2,
      "<END>": 3,
      "%": 4,
      ".": 5,
      "0": 6,
      "1": 7,
      "2": 8,
      "3": 9,
      "4": 10,
      "5": 11,
      "6": 12,
      ":": 13,
      "A": 14,
      "B": 15,
      "C": 16,
      "D": 17,
      "E": 18,
      "F": 19,
      "H": 20,
      "I": 21,
      "L": 22,
      "M": 23,
      "N": 24,
      "O": 25,
      "P": 26,
      "R": 27,
      "S": 28,
      "T": 29,
      "U": 30,
      "V": 31,
      "W": 32,
      "[": 33,
      "]": 34,
      "_": 35,
      "a": 36,
      "b": 37,
      "c": 38,
      "d": 39,
      "e": 40,
      "f": 41,
      "g": 42,
      "h": 43,
      "i": 44,
      "j": 45,
      "k": 46,
      "l": 47,
      "m": 48,
      "n": 49,
      "o": 50,
      "p": 51,
      "q": 52,
      "r": 53,
      "s": 54,
      "t": 55,
      "u": 56,
      "v": 57,
      "w": 58,
      "x": 59,
      "y": 60,
      "z": 61,
      "Г": 62,
      "Д": 63,
      "К": 64,
      "Л": 65,
      "М": 66,
      "Н": 67,
      "О": 68,
      "П": 69,
      "С": 70,
      "Ф": 71,
      "Х": 72,
      "Ц": 73,
      "Ш": 74,
      "Э": 75,
      "а": 76,
      "б": 77,
      "в": 78,
      "г": 79,
      "д": 80,
      "е": 81,
      "ж": 82,
      "з": 83,
      "и": 84,
      "й": 85,
      "к": 86,
      "л": 87,
      "м": 88,
      "н": 89,
      "о": 90,
      "п": 91,
      "р": 92,
      "с": 93,
      "т": 94,
      "у": 95,
      "ф": 96,
      "х": 97,
      "ц": 98,
      "ч": 99,
      "ш": 100,
      "щ": 101,
      "ъ": 102,
      "ы": 103,
      "ь": 104,
      "э": 105,
      "ю": 106,
      "я": 107,
      "ра": 108,
      "ро": 109,
      "про": 110,
      "ко": 111,
      "то": 112,
      "му": 113,
      "рам": 114,
      "грам": 115,
      "грамму": 116,
      "программу": 117,
      "тора": 118,
      "котора": 119,
      "которая": 120,
      "ет": 121,
      "ис": 122,
      "на": 123,
      "ля": 124,
      "да": 125,
      "ши": 126,
      "пи": 127,
      "чис": 128,
      "со": 129,
      "напи": 130,
      "напиши": 131,
      "зда": 132,
      "созда": 133,
      "создай": 134,
      "вы": 135,
      "ляет": 136,
      "вычис": 137,
      "вычисляет": 138,
      "ст": 139,
      "ен": 140,
      "но": 141,
      "по": 142,
      "ер": 143,
      "ем": 144,
      "ло": 145,
      "ует": 146,
      "ли": 147,
      "ль": 148,
      "ре": 149,
      "ва": 150,
      "го": 151,
      "ри": 152,
      "вер": 153,
      "ит": 154,
      "ни": 155,
      "во": 156,
      "зует": 157,
      "ла": 158,
      "ени": 159,
      "ци": 160,
      "ка": 161,
      "си": 162,
      "ти": 163,
      "бо": 164,
      "для": 165,
      "об": 166,
      "ност": 167,
      "поль": 168,
      "исполь": 169,
      "ми": 170,
      "рует": 171,
      "те": 172,
      "ма": 173,
      "US": 174,
      "ад": 175,
      "ки": 176,
      "дит": 177,
      "пло": 178,
      "щад": 179,
      "яет": 180,
      "площад": 181,
      "площадь": 182,
      "ны": 183,
      "st": 184,
      "ек": 185,
      "ес": 186,
      "провер": 187,
      "проверяет": 188,
      "ку": 189,
      "рабо": 190,
      "стро": 191,
      "ру": 192,
      "емо": 193,
      "ент": 194,
      "использует": 195,
      "али": 196,
      "нст": 197,
      "работ": 198,
      "LUS": 199,
      "PLUS": 200,
      "дв": 201,
      "объ": 202,
      "ности": 203,
      "из": 204,
      "мо": 205,
      "пер": 206,
      "число": 207,
      "вает": 208,
      "объем": 209,
      "демо": 210,
      "хо": 211,
      "чес": 212,
      "рирует": 213,
      "нстрирует": 214,
      "демонстрирует": 215,
      "::": 216,
      "до": 217,
      "ел": 218,
      "ну": 219,
      "реали": 220,
      "std": 221,
      "реализует": 222,
      "дра": 223,
      "числа": 224,
      "ное": 225,
      "за": 226,
      "сто": 227,
      "ум": 228,
      "ывает": 229,
      "ного": 230,
      "ера": 231,
      "па": 232,
      "нахо": 233,
      "верх": 234,
      "ения": 235,
      "ный": 236,
      "находит": 237,
      "ает": 238,
      "сси": 239,
      "поверх": 240,
      "вани": 241,
      "водит": 242,
      "ение": 243,
      "ность": 244,
      "дву": 245,
      "поверхности": 246,
      "вно": 247,
      "ди": 248,
      "три": 249,
      "фа": 250,
      "выводит": 251,
      "масси": 252,
      "ческо": 253,
      "двух": 254,
      "on": 255,
      "or": 256,
      "аб": 257,
      "ся": 258,
      "чисел": 259,
      "матри": 260,
      "матриц": 261,
      "IN": 262,
      "ec": 263,
      "вляет": 264,
      "де": 265,
      "ду": 266,
      "ме": 267,
      "оп": 268,
      "са": 269,
      "фф": 270,
      "тор": 271,
      "ери": 272,
      "использ": 273,
      "строки": 274,
      "пере": 275,
      "MIN": 276,
      "век": 277,
      "ей": 278,
      "зывает": 279,
      "ици": 280,
      "сло": 281,
      "эл": 282,
      "эдра": 283,
      "эфф": 284,
      "являет": 285,
      "нач": 286,
      "сть": 287,
      "пока": 288,
      "емен": 289,
      "ции": 290,
      "ческого": 291,
      "MINUS": 292,
      "является": 293,
      "показывает": 294,
      "20": 295,
      "at": 296,
      "ed": 297,
      "ан": 298,
      "имо": 299,
      "кла": 300,
      "мво": 301,
      "се": 302,
      "сл": 303,
      "ты": 304,
      "тре": 305,
      "уго": 306,
      "рав": 307,
      "ров": 308,
      "ком": 309,
      "кон": 310,
      "симво": 311,
      "уголь": 312,
      "er": 313,
      "ex": 314,
      "ве": 315,
      "га": 316,
      "знач": 317,
      "кци": 318,
      "нд": 319,
      "нкци": 320,
      "от": 321,
      "овани": 322,
      "сф": 323,
      "ту": 324,
      "ункци": 325,
      "функци": 326,
      "раз": 327,
      "коэфф": 328,
      "точ": 329,
      "итера": 330,
      "ений": 331,
      "тивно": 332,
      "екс": 333,
      "ную": 334,
      "матрицы": 335,
      "ect": 336,
      "ициент": 337,
      "угольни": 338,
      "коэффициент": 339,
      "an": 340,
      "es": 341,
      "in": 342,
      "ал": 343,
      "ген": 344,
      "еп": 345,
      "ель": 346,
      "ида": 347,
      "кру": 348,
      "при": 349,
      "сис": 350,
      "чи": 351,
      "ром": 352,
      "ста": 353,
      "работы": 354,
      "стоимо": 355,
      "массива": 356,
      "опера": 357,
      "использовани": 358,
      "сле": 359,
      "равн": 360,
      "символ": 361,
      "exp": 362,
      "итеративно": 363,
      "стоимость": 364,
      "использованием": 365,
      "2x": 366,
      "con": 367,
      "for": 368,
      "il": 369,
      "pt": 370,
      "гру": 371,
      "лекс": 372,
      "мы": 373,
      "мен": 374,
      "плекс": 375,
      "ры": 376,
      "ря": 377,
      "сум": 378,
      "ука": 379,
      "уравн": 380,
      "ча": 381,
      "шает": 382,
      "рас": 383,
      "кой": 384,
      "создает": 385,
      "обработ": 386,
      "строк": 387,
      "работу": 388,
      "зате": 389,
      "фай": 390,
      "дели": 391,
      "ерического": 392,
      "клас": 393,
      "комплекс": 394,
      "сферического": 395,
      "угольника": 396,
      "2x2": 397,
      "указате": 398,
      "ad": 399,
      "al": 400,
      "ar": 401,
      "em": 402,
      "ion": 403,
      "un": 404,
      "ар": 405,
      "ба": 406,
      "ви": 407,
      "ги": 408,
      "ез": 409,
      "кл": 410,
      "ква": 411,
      "мет": 412,
      "не": 413,
      "ор": 414,
      "пре": 415,
      "рси": 416,
      "рти": 417,
      "та": 418,
      "хро": 419,
      "яни": 420,
      "прост": 421,
      "ков": 422,
      "тов": 423,
      "рами": 424,
      "сорти": 425,
      "стру": 426,
      "нож": 427,
      "реку": 428,
      "решает": 429,
      "вой": 430,
      "цили": 431,
      "син": 432,
      "тирует": 433,
      "тему": 434,
      "еся": 435,
      "строка": 436,
      "перемен": 437,
      "ход": 438,
      "чески": 439,
      "доход": 440,
      "драт": 441,
      "стояни": 442,
      "умнож": 443,
      "саэдра": 444,
      "ерирует": 445,
      "трех": 446,
      "генерирует": 447,
      "систему": 448,
      "груз": 449,
      "сумму": 450,
      "расстояни": 451,
      "квадрат": 452,
      "рекурси": 453,
      "расстояние": 454,
      "3x": 455,
      "ID": 456,
      "ap": 457,
      "en": 458,
      "hr": 459,
      "ic": 460,
      "it": 461,
      "om": 462,
      "ty": 463,
      "НО": 464,
      "би": 465,
      "бы": 466,
      "все": 467,
      "гла": 468,
      "дел": 469,
      "дение": 470,
      "жду": 471,
      "кто": 472,
      "много": 473,
      "пла": 474,
      "пали": 475,
      "рен": 476,
      "рент": 477,
      "су": 478,
      "сч": 479,
      "сы": 480,
      "сек": 481,
      "тра": 482,
      "ую": 483,
      "уя": 484,
      "уда": 485,
      "цу": 486,
      "цент": 487,
      "чер": 488,
      "шаб": 489,
      "раж": 490,
      "рачи": 491,
      "ровани": 492,
      "произ": 493,
      "процент": 494,
      "торов": 495,
      "сов": 496,
      "сти": 497,
      "ень": 498,
      "нов": 499,
      "ной": 500,
      "под": 501,
      "пото": 502,
      "поточ": 503,
      "льный": 504,
      "гори": 505,
      "вертирует": 506,
      "низа": 507,
      "циф": 508,
      "обра": 509,
      "теж": 510,
      "тель": 511,
      "ные": 512,
      "stexp": 513,
      "ента": 514,
      "работает": 515,
      "две": 516,
      "абель": 517,
      "матрицу": 518,
      "мето": 519,
      "между": 520,
      "используя": 521,
      "вектор": 522,
      "слож": 523,
      "элемен": 524,
      "анти": 525,
      "конвертирует": 526,
      "ведение": 527,
      "значений": 528,
      "ing": 529,
      "алгори": 530,
      "след": 531,
      "constexp": 532,
      "обработки": 533,
      "строке": 534,
      "хрониза": 535,
      "просты": 536,
      "сортиров": 537,
      "синхрониза": 538,
      "рекурсивно": 539,
      "3x3": 540,
      "typ": 541,
      "многопоточ": 542,
      "палинд": 543,
      "рентабель": 544,
      "сектора": 545,
      "удаляет": 546,
      "шабло": 547,
      "произведение": 548,
      "элементов": 549,
      "алгорит": 550,
      "constexpr": 551,
      "синхронизации": 552,
      "DI": 553,
      "VID": 554,
      "as": 555,
      "ead": 556,
      "map": 557,
      "ran": 558,
      "thr": 559,
      "vect": 560,
      "бу": 561,
      "гм": 562,
      "дер": 563,
      "дли": 564,
      "еж": 565,
      "змы": 566,
      "ин": 567,
      "ико": 568,
      "лю": 569,
      "мя": 570,
      "ндра": 571,
      "оши": 572,
      "окру": 573,
      "пу": 574,
      "пря": 575,
      "ски": 576,
      "тет": 577,
      "тен": 578,
      "тер": 579,
      "угла": 580,
      "фор": 581,
      "цен": 582,
      "цеп": 583,
      "ше": 584,
      "щи": 585,
      "ради": 586,
      "рова": 587,
      "просто": 588,
      "кор": 589,
      "ляр": 590,
      "лями": 591,
      "выраж": 592,
      "степ": 593,
      "номи": 594,
      "емент": 595,
      "лоида": 596,
      "лип": 597,
      "риф": 598,
      "итывает": 599,
      "ний": 600,
      "вов": 601,
      "вого": 602,
      "ворачи": 603,
      "ении": 604,
      "ением": 605,
      "цикл": 606,
      "ками": 607,
      "бок": 608,
      "тей": 609,
      "кую": 610,
      "раболоида": 611,
      "строку": 612,
      "дом": 613,
      "елы": 614,
      "параболоида": 615,
      "ениями": 616,
      "опре": 617,
      "переста": 618,
      "перегруз": 619,
      "переворачи": 620,
      "вектора": 621,
      "векторов": 622,
      "элемент": 623,
      "эллип": 624,
      "ed_": 625,
      "сегм": 626,
      "треугольника": 627,
      "концеп": 628,
      "функций": 629,
      "функцию": 630,
      "ected": 631,
      "круга": 632,
      "призмы": 633,
      "массивами": 634,
      "оператор": 635,
      "операции": 636,
      "expected": 637,
      "ptr": 638,
      "меняет": 639,
      "файла": 640,
      "комплексное": 641,
      "преобра": 642,
      "цилиндра": 643,
      "доходность": 644,
      "НОД": 645,
      "платеж": 646,
      "считывает": 647,
      "через": 648,
      "новки": 649,
      "подсчитывает": 650,
      "потоков": 651,
      "методом": 652,
      "простым": 653,
      "type": 654,
      "рентабельность": 655,
      "алгоритм": 656,
      "DIVID": 657,
      "rang": 658,
      "thread": 659,
      "vector": 660,
      "длину": 661,
      "икосаэдра": 662,
      "ошибок": 663,
      "прямо": 664,
      "тетра": 665,
      "форма": 666,
      "рован": 667,
      "степень": 668,
      "перестановки": 669,
      "переворачивает": 670,
      "сегмента": 671,
      "концепты": 672,
      "преобразует": 673,
      "DIVIDE": 674,
      "..": 675,
      "AS": 676,
      "BI": 677,
      "CI": 678,
      "DA": 679,
      "EV": 680,
      "EBI": 681,
      "ST": 682,
      "TDA": 683,
      "_v": 684,
      "ail": 685,
      "bas": 686,
      "ce": 687,
      "ch": 688,
      "dec": 689,
      "der": 690,
      "fil": 691,
      "gn": 692,
      "if": 693,
      "ign": 694,
      "jthread": 695,
      "ltype": 696,
      "mo": 697,
      "mat": 698,
      "pl": 699,
      "pat": 700,
      "pan": 701,
      "span": 702,
      "ter": 703,
      "ur": 704,
      "ve": 705,
      "yst": 706,
      "Дей": 707,
      "Фи": 708,
      "ак": 709,
      "аро": 710,
      "ана": 711,
      "альный": 712,
      "бда": 713,
      "без": 714,
      "белы": 715,
      "вр": 716,
      "вра": 717,
      "вис": 718,
      "вну": 719,
      "вную": 720,
      "вую": 721,
      "ге": 722,
      "гра": 723,
      "гляет": 724,
      "гек": 725,
      "гей": 726,
      "ды": 727,
      "ден": 728,
      "доб": 729,
      "дывает": 730,
      "дне": 731,
      "деся": 732,
      "еч": 733,
      "жит": 734,
      "зу": 735,
      "инд": 736,
      "имен": 737,
      "ически": 738,
      "йное": 739,
      "кст": 740,
      "кре": 741,
      "кси": 742,
      "кту": 743,
      "лем": 744,
      "лениями": 745,
      "мер": 746,
      "мбда": 747,
      "нс": 748,
      "нт": 749,
      "ню": 750,
      "ня": 751,
      "ней": 752,
      "нные": 753,
      "од": 754,
      "око": 755,
      "пли": 756,
      "рму": 757,
      "рный": 758,
      "сем": 759,
      "сре": 760,
      "ска": 761,
      "скла": 762,
      "темо": 763,
      "таб": 764,
      "тан": 765,
      "трен": 766,
      "усло": 767,
      "усе": 768,
      "уча": 769,
      "усу": 770,
      "узу": 771,
      "физ": 772,
      "цель": 773,
      "чен": 774,
      "чное": 775,
      "чный": 776,
      "чений": 777,
      "шаро": 778,
      "щую": 779,
      "ющи": 780,
      "ючений": 781,
      "ромо": 782,
      "пробелы": 783,
      "кору": 784,
      "конст": 785,
      "том": 786,
      "муль": 787,
      "ета": 788,
      "иск": 789,
      "искл": 790,
      "нами": 791,
      "насле": 792,
      "нант": 793,
      "нарный": 794,
      "лямбда": 795,
      "данные": 796,
      "шиф": 797,
      "пирами": 798,
      "содер": 799,
      "вый": 800,
      "вычислениями": 801,
      "стек": 802,
      "норму": 803,
      "пов": 804,
      "пони": 805,
      "пога": 806,
      "послед": 807,
      "потен": 808,
      "емеся": 809,
      "лога": 810,
      "ловой": 811,
      "лицу": 812,
      "рег": 813,
      "ревер": 814,
      "год": 815,
      "рического": 816,
      "риал": 817,
      "нии": 818,
      "ницу": 819,
      "воз": 820,
      "вом": 821,
      "катор": 822,
      "каэдра": 823,
      "сии": 824,
      "сину": 825,
      "тины": 826,
      "типа": 827,
      "тировани": 828,
      "типли": 829,
      "бодо": 830,
      "бонач": 831,
      "минант": 832,
      "тела": 833,
      "теку": 834,
      "ным": 835,
      "ных": 836,
      "ными": 837,
      "str": 838,
      "есеч": 839,
      "куба": 840,
      "дви": 841,
      "двум": 842,
      "моду": 843,
      "пересеч": 844,
      "ческую": 845,
      "довани": 846,
      "памя": 847,
      "пании": 848,
      "динами": 849,
      "факто": 850,
      "фарен": 851,
      "массиве": 852,
      "массивов": 853,
      "ческой": 854,
      "order": 855,
      "декаэдра": 856,
      "эффек": 857,
      "atom": 858,
      "случа": 859,
      "компании": 860,
      "контей": 861,
      "значения": 862,
      "ндрического": 863,
      "размер": 864,
      "разницу": 865,
      "точками": 866,
      "esyst": 867,
      "генс": 868,
      "системо": 869,
      "ромбодо": 870,
      "format": 871,
      "ile": 872,
      "уравнения": 873,
      "уравнение": 874,
      "уравнений": 875,
      "файловой": 876,
      "делите": 877,
      "делитель": 878,
      "класс": 879,
      "комплексного": 880,
      "указатели": 881,
      "указателем": 882,
      "ari": 883,
      "ional": 884,
      "unorder": 885,
      "гипотен": 886,
      "нерами": 887,
      "таэдра": 888,
      "струю": 889,
      "структу": 890,
      "цилиндрического": 891,
      "переменной": 892,
      "переменных": 893,
      "доходности": 894,
      "умножения": 895,
      "умножает": 896,
      "квадратного": 897,
      "end": 898,
      "биноми": 899,
      "быструю": 900,
      "ктором": 901,
      "транс": 902,
      "рование": 903,
      "цифр": 904,
      "антипризмы": 905,
      "сортировки": 906,
      "сортировку": 907,
      "многопоточности": 908,
      "многопоточность": 909,
      "палиндром": 910,
      "палиндромо": 911,
      "шаблон": 912,
      "шаблоны": 913,
      "ежемеся": 914,
      "округляет": 915,
      "радиусу": 916,
      "корни": 917,
      "лярное": 918,
      "рифм": 919,
      "определитель": 920,
      "перегрузкой": 921,
      "ed_map": 922,
      "ranges": 923,
      "тетрагек": 924,
      "форматировани": 925,
      "ASCI": 926,
      "EBITDA": 927,
      "STL": 928,
      "based": 929,
      "decltype": 930,
      "filesyst": 931,
      "move": 932,
      "patter": 933,
      "Дейкст": 934,
      "Фибонач": 935,
      "врем": 936,
      "вращ": 937,
      "високо": 938,
      "внутрен": 939,
      "гейты": 940,
      "доба": 941,
      "днее": 942,
      "десяти": 943,
      "индекс": 944,
      "кредит": 945,
      "нюю": 946,
      "нях": 947,
      "семанти": 948,
      "среднее": 949,
      "скалярное": 950,
      "складывает": 951,
      "таблицу": 952,
      "тангенс": 953,
      "усечен": 954,
      "цельсии": 955,
      "шарового": 956,
      "корутины": 957,
      "мультипли": 958,
      "исключений": 959,
      "наследовани": 960,
      "пирамиды": 961,
      "понирует": 962,
      "погаш": 963,
      "последний": 964,
      "логарифм": 965,
      "реверс": 966,
      "синус": 967,
      "двумя": 968,
      "модуль": 969,
      "пересечение": 970,
      "факториал": 971,
      "фаренгейты": 972,
      "atomic": 973,
      "случайное": 974,
      "контейнерами": 975,
      "системой": 976,
      "ромбододекаэдра": 977,
      "unordered_map": 978,
      "гипотенузу": 979,
      "структуру": 980,
      "биномиальный": 981,
      "транспонирует": 982,
      "палиндромом": 983,
      "тетрагексаэдра": 984,
      "форматирования": 985,
      "ASCII": 986,
      "filesystem": 987,
      "pattern": 988,
      "Дейкстры": 989,
      "Фибоначчи": 990,
      "високос": 991,
      "внутреннюю": 992,
      "усеченного": 993,
      "мультипликатор": 994
    },
    "merges": [
      [
        "р",
        "а"
      ],
      [
        "р",
        "о"
      ],
      [
        "п",
        "ро"
      ],
      [
        "к",
        "о"
      ],
      [
        "т",
        "о"
      ],
      [
        "м",
        "у"
      ],
      [
        "ра",
        "м"
      ],
      [
        "г",
        "рам"
      ],
      [
        "грам",
        "му"
      ],
      [
        "про",
        "грамму"
      ],
      [
        "то",
        "ра"
      ],
      [
        "ко",
        "тора"
      ],
      [
        "котора",
        "я"
      ],
      [
        "е",
        "т"
      ],
      [
        "и",
        "с"
      ],
      [
        "н",
        "а"
      ],
      [
        "л",
        "я"
      ],
      [
        "д",
        "а"
      ],
      [
        "ш",
        "и"
      ],
      [
        "п",
        "и"
      ],
      [
        "ч",
        "ис"
      ],
      [
        "с",
        "о"
      ],
      [
        "на",
        "пи"
      ],
      [
        "напи",
        "ши"
      ],
      [
        "з",
        "да"
      ],
      [
        "со",
        "зда"
      ],
      [
        "созда",
        "й"
      ],
      [
        "в",
        "ы"
      ],
      [
        "ля",
        "ет"
      ],
      [
        "вы",
        "чис"
      ],
      [
        "вычис",
        "ляет"
      ],
      [
        "с",
        "т"
      ],
      [
        "е",
        "н"
      ],
      [
        "н",
        "о"
      ],
      [
        "п",
        "о"
      ],
      [
        "е",
        "р"
      ],
      [
        "е",
        "м"
      ],
      [
        "л",
        "о"
      ],
      [
        "у",
        "ет"
      ],
      [
        "л",
        "и"
      ],
      [
        "л",
        "ь"
      ],
      [
        "р",
        "е"
      ],
      [
        "в",
        "а"
      ],
      [
        "г",
        "о"
      ],
      [
        "р",
        "и"
      ],
      [
        "в",
        "ер"
      ],
      [
        "и",
        "т"
      ],
      [
        "н",
        "и"
      ],
      [
        "в",
        "о"
      ],
      [
        "з",
        "ует"
      ],
      [
        "л",
        "а"
      ],
      [
        "ен",
        "и"
      ],
      [
        "ц",
        "и"
      ],
      [
        "к",
        "а"
      ],
      [
        "с",
        "и"
      ],
      [
        "т",
        "и"
      ],
      [
        "б",
        "о"
      ],
      [
        "д",
        "ля"
      ],
      [
        "о",
        "б"
      ],
      [
        "но",
        "ст"
      ],
      [
        "по",
        "ль"
      ],
      [
        "ис",
        "поль"
      ],
      [
        "м",
        "и"
      ],
      [
        "р",
        "ует"
      ],
      [
        "т",
        "е"
      ],
      [
        "м",
        "а"
      ],
      [
        "U",
        "S"
      ],
      [
        "а",
        "д"
      ],
      [
        "к",
        "и"
      ],
      [
        "д",
        "ит"
      ],
      [
        "п",
        "ло"
      ],
      [
        "щ",
        "ад"
      ],
      [
        "я",
        "ет"
      ],
      [
        "пло",
        "щад"
      ],
      [
        "площад",
        "ь"
      ],
      [
        "н",
        "ы"
      ],
      [
        "s",
        "t"
      ],
      [
        "е",
        "к"
      ],
      [
        "е",
        "с"
      ],
      [
        "про",
        "вер"
      ],
      [
        "провер",
        "яет"
      ],
      [
        "к",
        "у"
      ],
      [
        "ра",
        "бо"
      ],
      [
        "ст",
        "ро"
      ],
      [
        "р",
        "у"
      ],
      [
        "ем",
        "о"
      ],
      [
        "ен",
        "т"
      ],
      [
        "исполь",
        "зует"
      ],
      [
        "а",
        "ли"
      ],
      [
        "н",
        "ст"
      ],
      [
        "рабо",
        "т"
      ],
      [
        "L",
        "US"
      ],
      [
        "P",
        "LUS"
      ],
      [
        "д",
        "в"
      ],
      [
        "об",
        "ъ"
      ],
      [
        "ност",
        "и"
      ],
      [
        "и",
        "з"
      ],
      [
        "м",
        "о"
      ],
      [
        "п",
        "ер"
      ],
      [
        "чис",
        "ло"
      ],
      [
        "ва",
        "ет"
      ],
      [
        "объ",
        "ем"
      ],
      [
        "д",
        "емо"
      ],
      [
        "х",
        "о"
      ],
      [
        "ч",
        "ес"
      ],
      [
        "ри",
        "рует"
      ],
      [
        "нст",
        "рирует"
      ],
      [
        "демо",
        "нстрирует"
      ],
      [
        ":",
        ":"
      ],
      [
        "д",
        "о"
      ],
      [
        "е",
        "л"
      ],
      [
        "н",
        "у"
      ],
      [
        "ре",
        "али"
      ],
      [
        "st",
        "d"
      ],
      [
        "реали",
        "зует"
      ],
      [
        "д",
        "ра"
      ],
      [
        "чис",
        "ла"
      ],
      [
        "но",
        "е"
      ],
      [
        "з",
        "а"
      ],
      [
        "с",
        "то"
      ],
      [
        "у",
        "м"
      ],
      [
        "ы",
        "вает"
      ],
      [
        "но",
        "го"
      ],
      [
        "е",
        "ра"
      ],
      [
        "п",
        "а"
      ],
      [
        "на",
        "хо"
      ],
      [
        "вер",
        "х"
      ],
      [
        "ени",
        "я"
      ],
      [
        "ны",
        "й"
      ],
      [
        "нахо",
        "дит"
      ],
      [
        "а",
        "ет"
      ],
      [
        "с",
        "си"
      ],
      [
        "по",
        "верх"
      ],
      [
        "ва",
        "ни"
      ],
      [
        "во",
        "дит"
      ],
      [
        "ени",
        "е"
      ],
      [
        "ност",
        "ь"
      ],
      [
        "дв",
        "у"
      ],
      [
        "поверх",
        "ности"
      ],
      [
        "в",
        "но"
      ],
      [
        "д",
        "и"
      ],
      [
        "т",
        "ри"
      ],
      [
        "ф",
        "а"
      ],
      [
        "вы",
        "водит"
      ],
      [
        "ма",
        "сси"
      ],
      [
        "чес",
        "ко"
      ],
      [
        "дву",
        "х"
      ],
      [
        "o",
        "n"
      ],
      [
        "o",
        "r"
      ],
      [
        "а",
        "б"
      ],
      [
        "с",
        "я"
      ],
      [
        "чис",
        "ел"
      ],
      [
        "ма",
        "три"
      ],
      [
        "матри",
        "ц"
      ],
      [
        "I",
        "N"
      ],
      [
        "e",
        "c"
      ],
      [
        "в",
        "ляет"
      ],
      [
        "д",
        "е"
      ],
      [
        "д",
        "у"
      ],
      [
        "м",
        "е"
      ],
      [
        "о",
        "п"
      ],
      [
        "с",
        "а"
      ],
      [
        "ф",
        "ф"
      ],
      [
        "то",
        "р"
      ],
      [
        "ер",
        "и"
      ],
      [
        "исполь",
        "з"
      ],
      [
        "стро",
        "ки"
      ],
      [
        "пер",
        "е"
      ],
      [
        "M",
        "IN"
      ],
      [
        "в",
        "ек"
      ],
      [
        "е",
        "й"
      ],
      [
        "з",
        "ывает"
      ],
      [
        "и",
        "ци"
      ],
      [
        "с",
        "ло"
      ],
      [
        "э",
        "л"
      ],
      [
        "э",
        "дра"
      ],
      [
        "э",
        "фф"
      ],
      [
        "я",
        "вляет"
      ],
      [
        "на",
        "ч"
      ],
      [
        "ст",
        "ь"
      ],
      [
        "по",
        "ка"
      ],
      [
        "ем",
        "ен"
      ],
      [
        "ци",
        "и"
      ],
      [
        "ческо",
        "го"
      ],
      [
        "MIN",
        "US"
      ],
      [
        "являет",
        "ся"
      ],
      [
        "пока",
        "зывает"
      ],
      [
        "2",
        "0"
      ],
      [
        "a",
        "t"
      ],
      [
        "e",
        "d"
      ],
      [
        "а",
        "н"
      ],
      [
        "и",
        "мо"
      ],
      [
        "к",
        "ла"
      ],
      [
        "м",
        "во"
      ],
      [
        "с",
        "е"
      ],
      [
        "с",
        "л"
      ],
      [
        "т",
        "ы"
      ],
      [
        "т",
        "ре"
      ],
      [
        "у",
        "го"
      ],
      [
        "ра",
        "в"
      ],
      [
        "ро",
        "в"
      ],
      [
        "ко",
        "м"
      ],
      [
        "ко",
        "н"
      ],
      [
        "си",
        "мво"
      ],
      [
        "уго",
        "ль"
      ],
      [
        "e",
        "r"
      ],
      [
        "e",
        "x"
      ],
      [
        "в",
        "е"
      ],
      [
        "г",
        "а"
      ],
      [
        "з",
        "нач"
      ],
      [
        "к",
        "ци"
      ],
      [
        "н",
        "д"
      ],
      [
        "н",
        "кци"
      ],
      [
        "о",
        "т"
      ],
      [
        "о",
        "вани"
      ],
      [
        "с",
        "ф"
      ],
      [
        "т",
        "у"
      ],
      [
        "у",
        "нкци"
      ],
      [
        "ф",
        "ункци"
      ],
      [
        "ра",
        "з"
      ],
      [
        "ко",
        "эфф"
      ],
      [
        "то",
        "ч"
      ],
      [
        "ит",
        "ера"
      ],
      [
        "ени",
        "й"
      ],
      [
        "ти",
        "вно"
      ],
      [
        "ек",
        "с"
      ],
      [
        "ну",
        "ю"
      ],
      [
        "матриц",
        "ы"
      ],
      [
        "ec",
        "t"
      ],
      [
        "ици",
        "ент"
      ],
      [
        "уголь",
        "ни"
      ],
      [
        "коэфф",
        "ициент"
      ],
      [
        "a",
        "n"
      ],
      [
        "e",
        "s"
      ],
      [
        "i",
        "n"
      ],
      [
        "а",
        "л"
      ],
      [
        "г",
        "ен"
      ],
      [
        "е",
        "п"
      ],
      [
        "е",
        "ль"
      ],
      [
        "и",
        "да"
      ],
      [
        "к",
        "ру"
      ],
      [
        "п",
        "ри"
      ],
      [
        "с",
        "ис"
      ],
      [
        "ч",
        "и"
      ],
      [
        "ро",
        "м"
      ],
      [
        "ст",
        "а"
      ],
      [
        "работ",
        "ы"
      ],
      [
        "сто",
        "имо"
      ],
      [
        "масси",
        "ва"
      ],
      [
        "оп",
        "ера"
      ],
      [
        "использ",
        "овани"
      ],
      [
        "сл",
        "е"
      ],
      [
        "рав",
        "н"
      ],
      [
        "симво",
        "л"
      ],
      [
        "ex",
        "p"
      ],
      [
        "итера",
        "тивно"
      ],
      [
        "стоимо",
        "сть"
      ],
      [
        "использовани",
        "ем"
      ],
      [
        "2",
        "x"
      ],
      [
        "c",
        "on"
      ],
      [
        "f",
        "or"
      ],
      [
        "i",
        "l"
      ],
      [
        "p",
        "t"
      ],
      [
        "г",
        "ру"
      ],
      [
        "л",
        "екс"
      ],
      [
        "м",
        "ы"
      ],
      [
        "м",
        "ен"
      ],
      [
        "п",
        "лекс"
      ],
      [
        "р",
        "ы"
      ],
      [
        "р",
        "я"
      ],
      [
        "с",
        "ум"
      ],
      [
        "у",
        "ка"
      ],
      [
        "у",
        "равн"
      ],
      [
        "ч",
        "а"
      ],
      [
        "ш",
        "ает"
      ],
      [
        "ра",
        "с"
      ],
      [
        "ко",
        "й"
      ],
      [
        "созда",
        "ет"
      ],
      [
        "об",
        "работ"
      ],
      [
        "стро",
        "к"
      ],
      [
        "работ",
        "у"
      ],
      [
        "за",
        "те"
      ],
      [
        "фа",
        "й"
      ],
      [
        "де",
        "ли"
      ],
      [
        "ери",
        "ческого"
      ],
      [
        "кла",
        "с"
      ],
      [
        "ком",
        "плекс"
      ],
      [
        "сф",
        "ерического"
      ],
      [
        "угольни",
        "ка"
      ],
      [
        "2x",
        "2"
      ],
      [
        "ука",
        "зате"
      ],
      [
        "a",
        "d"
      ],
      [
        "a",
        "l"
      ],
      [
        "a",
        "r"
      ],
      [
        "e",
        "m"
      ],
      [
        "i",
        "on"
      ],
      [
        "u",
        "n"
      ],
      [
        "а",
        "р"
      ],
      [
        "б",
        "а"
      ],
      [
        "в",
        "и"
      ],
      [
        "г",
        "и"
      ],
      [
        "е",
        "з"
      ],
      [
        "к",
        "л"
      ],
      [
        "к",
        "ва"
      ],
      [
        "м",
        "ет"
      ],
      [
        "н",
        "е"
      ],
      [
        "о",
        "р"
      ],
      [
        "п",
        "ре"
      ],
      [
        "р",
        "си"
      ],
      [
        "р",
        "ти"
      ],
      [
        "т",
        "а"
      ],
      [
        "х",
        "ро"
      ],
      [
        "я",
        "ни"
      ],
      [
        "про",
        "ст"
      ],
      [
        "ко",
        "в"
      ],
      [
        "то",
        "в"
      ],
      [
        "рам",
        "и"
      ],
      [
        "со",
        "рти"
      ],
      [
        "ст",
        "ру"
      ],
      [
        "но",
        "ж"
      ],
      [
        "ре",
        "ку"
      ],
      [
        "ре",
        "шает"
      ],
      [
        "во",
        "й"
      ],
      [
        "ци",
        "ли"
      ],
      [
        "си",
        "н"
      ],
      [
        "ти",
        "рует"
      ],
      [
        "те",
        "му"
      ],
      [
        "ес",
        "я"
      ],
      [
        "стро",
        "ка"
      ],
      [
        "пер",
        "емен"
      ],
      [
        "хо",
        "д"
      ],
      [
        "чес",
        "ки"
      ],
      [
        "до",
        "ход"
      ],
      [
        "дра",
        "т"
      ],
      [
        "сто",
        "яни"
      ],
      [
        "ум",
        "нож"
      ],
      [
        "са",
        "эдра"
      ],
      [
        "ери",
        "рует"
      ],
      [
        "тре",
        "х"
      ],
      [
        "ген",
        "ерирует"
      ],
      [
        "сис",
        "тему"
      ],
      [
        "гру",
        "з"
      ],
      [
        "сум",
        "му"
      ],
      [
        "рас",
        "стояни"
      ],
      [
        "ква",
        "драт"
      ],
      [
        "реку",
        "рси"
      ],
      [
        "расстояни",
        "е"
      ],
      [
        "3",
        "x"
      ],
      [
        "I",
        "D"
      ],
      [
        "a",
        "p"
      ],
      [
        "e",
        "n"
      ],
      [
        "h",
        "r"
      ],
      [
        "i",
        "c"
      ],
      [
        "i",
        "t"
      ],
      [
        "o",
        "m"
      ],
      [
        "t",
        "y"
      ],
      [
        "Н",
        "О"
      ],
      [
        "б",
        "и"
      ],
      [
        "б",
        "ы"
      ],
      [
        "в",
        "се"
      ],
      [
        "г",
        "ла"
      ],
      [
        "д",
        "ел"
      ],
      [
        "д",
        "ение"
      ],
      [
        "ж",
        "ду"
      ],
      [
        "к",
        "то"
      ],
      [
        "м",
        "ного"
      ],
      [
        "п",
        "ла"
      ],
      [
        "п",
        "али"
      ],
      [
        "р",
        "ен"
      ],
      [
        "р",
        "ент"
      ],
      [
        "с",
        "у"
      ],
      [
        "с",
        "ч"
      ],
      [
        "с",
        "ы"
      ],
      [
        "с",
        "ек"
      ],
      [
        "т",
        "ра"
      ],
      [
        "у",
        "ю"
      ],
      [
        "у",
        "я"
      ],
      [
        "у",
        "да"
      ],
      [
        "ц",
        "у"
      ],
      [
        "ц",
        "ент"
      ],
      [
        "ч",
        "ер"
      ],
      [
        "ш",
        "аб"
      ],
      [
        "ра",
        "ж"
      ],
      [
        "ра",
        "чи"
      ],
      [
        "ро",
        "вани"
      ],
      [
        "про",
        "из"
      ],
      [
        "про",
        "цент"
      ],
      [
        "то",
        "ров"
      ],
      [
        "со",
        "в"
      ],
      [
        "ст",
        "и"
      ],
      [
        "ен",
        "ь"
      ],
      [
        "но",
        "в"
      ],
      [
        "но",
        "й"
      ],
      [
        "по",
        "д"
      ],
      [
        "по",
        "то"
      ],
      [
        "по",
        "точ"
      ],
      [
        "ль",
        "ный"
      ],
      [
        "го",
        "ри"
      ],
      [
        "вер",
        "тирует"
      ],
      [
        "ни",
        "за"
      ],
      [
        "ци",
        "ф"
      ],
      [
        "об",
        "ра"
      ],
      [
        "те",
        "ж"
      ],
      [
        "те",
        "ль"
      ],
      [
        "ны",
        "е"
      ],
      [
        "st",
        "exp"
      ],
      [
        "ент",
        "а"
      ],
      [
        "работ",
        "ает"
      ],
      [
        "дв",
        "е"
      ],
      [
        "аб",
        "ель"
      ],
      [
        "матриц",
        "у"
      ],
      [
        "ме",
        "то"
      ],
      [
        "ме",
        "жду"
      ],
      [
        "использ",
        "уя"
      ],
      [
        "век",
        "тор"
      ],
      [
        "сло",
        "ж"
      ],
      [
        "эл",
        "емен"
      ],
      [
        "ан",
        "ти"
      ],
      [
        "кон",
        "вертирует"
      ],
      [
        "ве",
        "дение"
      ],
      [
        "знач",
        "ений"
      ],
      [
        "in",
        "g"
      ],
      [
        "ал",
        "гори"
      ],
      [
        "сле",
        "д"
      ],
      [
        "con",
        "stexp"
      ],
      [
        "обработ",
        "ки"
      ],
      [
        "строк",
        "е"
      ],
      [
        "хро",
        "низа"
      ],
      [
        "прост",
        "ы"
      ],
      [
        "сорти",
        "ров"
      ],
      [
        "син",
        "хрониза"
      ],
      [
        "рекурси",
        "вно"
      ],
      [
        "3x",
        "3"
      ],
      [
        "ty",
        "p"
      ],
      [
        "много",
        "поточ"
      ],
      [
        "пали",
        "нд"
      ],
      [
        "рент",
        "абель"
      ],
      [
        "сек",
        "тора"
      ],
      [
        "уда",
        "ляет"
      ],
      [
        "шаб",
        "ло"
      ],
      [
        "произ",
        "ведение"
      ],
      [
        "элемен",
        "тов"
      ],
      [
        "алгори",
        "т"
      ],
      [
        "constexp",
        "r"
      ],
      [
        "синхрониза",
        "ции"
      ],
      [
        "D",
        "I"
      ],
      [
        "V",
        "ID"
      ],
      [
        "a",
        "s"
      ],
      [
        "e",
        "ad"
      ],
      [
        "m",
        "ap"
      ],
      [
        "r",
        "an"
      ],
      [
        "t",
        "hr"
      ],
      [
        "v",
        "ect"
      ],
      [
        "б",
        "у"
      ],
      [
        "г",
        "м"
      ],
      [
        "д",
        "ер"
      ],
      [
        "д",
        "ли"
      ],
      [
        "е",
        "ж"
      ],
      [
        "з",
        "мы"
      ],
      [
        "и",
        "н"
      ],
      [
        "и",
        "ко"
      ],
      [
        "л",
        "ю"
      ],
      [
        "м",
        "я"
      ],
      [
        "н",
        "дра"
      ],
      [
        "о",
        "ши"
      ],
      [
        "о",
        "кру"
      ],
      [
        "п",
        "у"
      ],
      [
        "п",
        "ря"
      ],
      [
        "с",
        "ки"
      ],
      [
        "т",
        "ет"
      ],
      [
        "т",
        "ен"
      ],
      [
        "т",
        "ер"
      ],
      [
        "у",
        "гла"
      ],
      [
        "ф",
        "ор"
      ],
      [
        "ц",
        "ен"
      ],
      [
        "ц",
        "еп"
      ],
      [
        "ш",
        "е"
      ],
      [
        "щ",
        "и"
      ],
      [
        "ра",
        "ди"
      ],
      [
        "ро",
        "ва"
      ],
      [
        "про",
        "сто"
      ],
      [
        "ко",
        "р"
      ],
      [
        "ля",
        "р"
      ],
      [
        "ля",
        "ми"
      ],
      [
        "вы",
        "раж"
      ],
      [
        "ст",
        "еп"
      ],
      [
        "но",
        "ми"
      ],
      [
        "ем",
        "ент"
      ],
      [
        "ло",
        "ида"
      ],
      [
        "ли",
        "п"
      ],
      [
        "ри",
        "ф"
      ],
      [
        "ит",
        "ывает"
      ],
      [
        "ни",
        "й"
      ],
      [
        "во",
        "в"
      ],
      [
        "во",
        "го"
      ],
      [
        "во",
        "рачи"
      ],
      [
        "ени",
        "и"
      ],
      [
        "ени",
        "ем"
      ],
      [
        "ци",
        "кл"
      ],
      [
        "ка",
        "ми"
      ],
      [
        "бо",
        "к"
      ],
      [
        "те",
        "й"
      ],
      [
        "ку",
        "ю"
      ],
      [
        "рабо",
        "лоида"
      ],
      [
        "стро",
        "ку"
      ],
      [
        "до",
        "м"
      ],
      [
        "ел",
        "ы"
      ],
      [
        "па",
        "раболоида"
      ],
      [
        "ения",
        "ми"
      ],
      [
        "оп",
        "ре"
      ],
      [
        "пере",
        "ста"
      ],
      [
        "пере",
        "груз"
      ],
      [
        "пере",
        "ворачи"
      ],
      [
        "век",
        "тора"
      ],
      [
        "век",
        "торов"
      ],
      [
        "эл",
        "емент"
      ],
      [
        "эл",
        "лип"
      ],
      [
        "ed",
        "_"
      ],
      [
        "се",
        "гм"
      ],
      [
        "тре",
        "угольника"
      ],
      [
        "кон",
        "цеп"
      ],
      [
        "функци",
        "й"
      ],
      [
        "функци",
        "ю"
      ],
      [
        "ect",
        "ed"
      ],
      [
        "кру",
        "га"
      ],
      [
        "при",
        "змы"
      ],
      [
        "массива",
        "ми"
      ],
      [
        "опера",
        "тор"
      ],
      [
        "опера",
        "ции"
      ],
      [
        "exp",
        "ected"
      ],
      [
        "pt",
        "r"
      ],
      [
        "мен",
        "яет"
      ],
      [
        "фай",
        "ла"
      ],
      [
        "комплекс",
        "ное"
      ],
      [
        "пре",
        "обра"
      ],
      [
        "цили",
        "ндра"
      ],
      [
        "доход",
        "ность"
      ],
      [
        "НО",
        "Д"
      ],
      [
        "пла",
        "теж"
      ],
      [
        "сч",
        "итывает"
      ],
      [
        "чер",
        "ез"
      ],
      [
        "нов",
        "ки"
      ],
      [
        "под",
        "считывает"
      ],
      [
        "пото",
        "ков"
      ],
      [
        "мето",
        "дом"
      ],
      [
        "просты",
        "м"
      ],
      [
        "typ",
        "e"
      ],
      [
        "рентабель",
        "ность"
      ],
      [
        "алгорит",
        "м"
      ],
      [
        "DI",
        "VID"
      ],
      [
        "ran",
        "g"
      ],
      [
        "thr",
        "ead"
      ],
      [
        "vect",
        "or"
      ],
      [
        "дли",
        "ну"
      ],
      [
        "ико",
        "саэдра"
      ],
      [
        "оши",
        "бок"
      ],
      [
        "пря",
        "мо"
      ],
      [
        "тет",
        "ра"
      ],
      [
        "фор",
        "ма"
      ],
      [
        "рова",
        "н"
      ],
      [
        "степ",
        "ень"
      ],
      [
        "переста",
        "новки"
      ],
      [
        "переворачи",
        "вает"
      ],
      [
        "сегм",
        "ента"
      ],
      [
        "концеп",
        "ты"
      ],
      [
        "преобра",
        "зует"
      ],
      [
        "DIVID",
        "E"
      ],
      [
        ".",
        "."
      ],
      [
        "A",
        "S"
      ],
      [
        "B",
        "I"
      ],
      [
        "C",
        "I"
      ],
      [
        "D",
        "A"
      ],
      [
        "E",
        "V"
      ],
      [
        "E",
        "BI"
      ],
      [
        "S",
        "T"
      ],
      [
        "T",
        "DA"
      ],
      [
        "_",
        "v"
      ],
      [
        "a",
        "il"
      ],
      [
        "b",
        "as"
      ],
      [
        "c",
        "e"
      ],
      [
        "c",
        "h"
      ],
      [
        "d",
        "ec"
      ],
      [
        "d",
        "er"
      ],
      [
        "f",
        "il"
      ],
      [
        "g",
        "n"
      ],
      [
        "i",
        "f"
      ],
      [
        "i",
        "gn"
      ],
      [
        "j",
        "thread"
      ],
      [
        "l",
        "type"
      ],
      [
        "m",
        "o"
      ],
      [
        "m",
        "at"
      ],
      [
        "p",
        "l"
      ],
      [
        "p",
        "at"
      ],
      [
        "p",
        "an"
      ],
      [
        "s",
        "pan"
      ],
      [
        "t",
        "er"
      ],
      [
        "u",
        "r"
      ],
      [
        "v",
        "e"
      ],
      [
        "y",
        "st"
      ],
      [
        "Д",
        "ей"
      ],
      [
        "Ф",
        "и"
      ],
      [
        "а",
        "к"
      ],
      [
        "а",
        "ро"
      ],
      [
        "а",
        "на"
      ],
      [
        "а",
        "льный"
      ],
      [
        "б",
        "да"
      ],
      [
        "б",
        "ез"
      ],
      [
        "б",
        "елы"
      ],
      [
        "в",
        "р"
      ],
      [
        "в",
        "ра"
      ],
      [
        "в",
        "ис"
      ],
      [
        "в",
        "ну"
      ],
      [
        "в",
        "ную"
      ],
      [
        "в",
        "ую"
      ],
      [
        "г",
        "е"
      ],
      [
        "г",
        "ра"
      ],
      [
        "г",
        "ляет"
      ],
      [
        "г",
        "ек"
      ],
      [
        "г",
        "ей"
      ],
      [
        "д",
        "ы"
      ],
      [
        "д",
        "ен"
      ],
      [
        "д",
        "об"
      ],
      [
        "д",
        "ывает"
      ],
      [
        "д",
        "не"
      ],
      [
        "д",
        "еся"
      ],
      [
        "е",
        "ч"
      ],
      [
        "ж",
        "ит"
      ],
      [
        "з",
        "у"
      ],
      [
        "и",
        "нд"
      ],
      [
        "и",
        "мен"
      ],
      [
        "и",
        "чески"
      ],
      [
        "й",
        "ное"
      ],
      [
        "к",
        "ст"
      ],
      [
        "к",
        "ре"
      ],
      [
        "к",
        "си"
      ],
      [
        "к",
        "ту"
      ],
      [
        "л",
        "ем"
      ],
      [
        "л",
        "ениями"
      ],
      [
        "м",
        "ер"
      ],
      [
        "м",
        "бда"
      ],
      [
        "н",
        "с"
      ],
      [
        "н",
        "т"
      ],
      [
        "н",
        "ю"
      ],
      [
        "н",
        "я"
      ],
      [
        "н",
        "ей"
      ],
      [
        "н",
        "ные"
      ],
      [
        "о",
        "д"
      ],
      [
        "о",
        "ко"
      ],
      [
        "п",
        "ли"
      ],
      [
        "р",
        "му"
      ],
      [
        "р",
        "ный"
      ],
      [
        "с",
        "ем"
      ],
      [
        "с",
        "ре"
      ],
      [
        "с",
        "ка"
      ],
      [
        "с",
        "кла"
      ],
      [
        "т",
        "емо"
      ],
      [
        "т",
        "аб"
      ],
      [
        "т",
        "ан"
      ],
      [
        "т",
        "рен"
      ],
      [
        "у",
        "сло"
      ],
      [
        "у",
        "се"
      ],
      [
        "у",
        "ча"
      ],
      [
        "у",
        "су"
      ],
      [
        "у",
        "зу"
      ],
      [
        "ф",
        "из"
      ],
      [
        "ц",
        "ель"
      ],
      [
        "ч",
        "ен"
      ],
      [
        "ч",
        "ное"
      ],
      [
        "ч",
        "ный"
      ],
      [
        "ч",
        "ений"
      ],
      [
        "ш",
        "аро"
      ],
